[{"category": "Registration", "title": "Registration", "description": "Badge collection is available in the Exhibition Hall Foyer area of the convention centre. This is for delegates who have registered online and purchased a ticket for Inventures in advance using our online registration system.   STUDENTS AND MEDIA: Badge collection for students and media is available at the kiosk window/counter just inside the ground-level entrance to the convention centre North Building, just beyond the convention centre information desk. Student ID or Media Accreditation must be shown to collect your badge.  ONSITE TICKET PURCHASE: If you need to purchase a ticket onsite, we encourage you to use the online registration link available on the Inventures 2024 website using your smartphone or laptop. You can then pick up your badge at registration. Should you require assistance with the onsite purchase of tickets, please visit the kiosk window/counter just inside the ground-level entrance to the convention centre North Building, just beyond the convention centre information desk. Onsite ticket purchase is not available at any other location.", "speakers": []}, {"category": "Breakfast & Networking", "title": "Breakfast Bites & Networking", "description": "Join us for coffee, light breakfast bites, and networking before the start of Inventures programming, available in the Exhibition Hall Foyer and Hall E.", "speakers": []}, {"category": "Keynote", "title": "Opening Ceremony and Keynote: Where Humanity Meets Technology", "description": "The Inventures 2024 Opening Ceremony brings to life the story of what happens at the nexus of humanity and technology. An immersive experience featuring local and national musicians, dancers and singers will set the stage for the three-day journey of connection, inspiration, and innovation that lies ahead.  Following the Opening Ceremony, we’ll be inspired by an opening keynote from award-winning marketer and cultural translator Dr. Marcus Collins.   Dr. Collins has spent a career bridging the nexus of humanity and technology, with strategies and creative contributions that span music, sport, technology, advertising, and academia. Drawing from this experience and expertise, Marcus will share insights on how to create culturally contagious ideas that inspire people to take action.  Culture is a word we often use but seldom fully understand. So, why does that matter? Because there’s no force more influential on human behavior than culture. What we wear, what we watch, who we marry, how we vote, what we support, and just about every aspect of daily living is informed by—and in many ways governed by—our cultural subscription.  At the end of the day, no matter what industry we’re in, the primary goal is to get people to action—to buy, to watch, to click, to vote, to subscribe. In this inspiring keynote talk, Dr. Collins will unpack how we can leverage culture to drive action where humanity meets technology.", "speakers": [{"name": "Dr. Marcus Collins", "position": "Professor"}, {"name": "Laura Kilcrease", "position": "Chief Executive Officer at Alberta Innovates"}, {"name": "Chief Lee Crowchild", "position": "Former Xakiji (Chief) at Tsuut’ina First Nation"}, {"name": "Darrell Brertton", "position": "Saddle Lake Cree Nation"}]}, {"category": "Networking", "title": "Networking Break", "description": "Refreshments will be available in all pre-function areas of the conference centre throughout the event, including during networking breaks.   Grab a drink and a snack in the Exhibition Hall Foyer, Macleod Foyer, Telus Foyer, or Glen Foyer. This is a great opportunity to visit the exhibitors and experiential elements of Inventures.", "speakers": []}, {"category": "Keynote", "title": "Book Signing: Dr. Marcus Collins", "description": "Culture is a word we often use but seldom fully understand. So, why does that matter? Because there’s no force more influential on human behavior than culture. What we wear, what we watch, who we marry, how we vote, what we support, and just about every aspect of daily living is informed by—and in many ways governed by—our cultural subscription. Therefore, if we can fully understand what culture is and the underlying physics of how it works, then we can leverage its sway to get people to take action. Of course, this is powerful for marketers, politicians, leaders, managers, and anyone with a vested interest in getting people to move.  That’s exactly what Dr. Marcus Collins’ book, For the Culture: The Power Behind What We Buy, What We Do, and Who We Want to Be, aims to achieve: to help people get people to move. He pulls from both theory and practice—using stories from his own work spearheading digital strategy for Beyoncé to working with fortune 500 companies like Apple, McDonald’s, and State Farm—to break down the ways in which culture influences behavior. He then unpacks for readers how you can do the same by integrating a deep perspective of culture, based on a century’s worth of data, and an understanding of the possibilities of today’s hyper-connected world.", "speakers": [{"name": "Dr. Marcus Collins", "position": "Professor"}]}, {"category": "Networking", "title": "Connection Hub at The Colab: powered by University of Alberta", "description": "Looking for a quiet place to have a 1:1 chat? This is your space. Welcome to Connection Hub at The Colab, your spot for one-on-one discussions at Inventures. Designed for intimate networking and collaboration, this space accommodates up to 11 pairs at a time, ensuring meaningful interactions and focused conversations. Engage directly with members of the University of Alberta team, share insights, explore potential collaborations, and discuss future opportunities. Activated by University of Alberta as part of their sponsorship, this hub serves as a focal point for innovation and partnership.", "speakers": []}, {"category": "Entrepreneurship", "title": "Exploring Innovations Through Global Collaborations", "description": "Successful innovation ecosystems do not happen by accident, and they are not created overnight. Join this session to hear expert perspectives on the vital role of global collaboration in building ecosystems that foster healthy and dynamic research, catalyse impactful innovation, and provide the resources required to scale businesses and solutions – here in Canada, and around the world.", "speakers": [{"name": "Dr. Michael Robertson", "position": "CSIRO Australia at Director of Agriculture & Food"}, {"name": "Darren Fast", "position": "AVP - Innovation, Knowledge Mobilization & Partnerships at University of Alberta"}, {"name": "Jacqueline Wilson-Smith", "position": "Director & Strategic Facilitator at Sustainable Innovation Co. - Impact Facilitation"}, {"name": "David Sweeney", "position": "Professor of Research Policy at University of Birmingham"}]}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "Measuring for Success: How Data, Measurement & Technology are Advancing Sustainable Food Systems", "description": "New environmental standards across Canadian and global food systems are helping to guide continuous improvements in emissions management, water use, land stewardship, waste management and energy efficiency. Throughout food value chains, this is driving producers, processors, retailers and exporters to rise to a new level of data management and measurements. Join this session to learn how organizations across value chains stand to benefit from taking unified approaches to measurement, and the technologies and tools that will help them be successful.", "speakers": [{"name": "David McInnes", "position": "Executive Director & Founder at Centre for Agri-Food Benchmarking"}, {"name": "Julie Olmstead", "position": "Vice Chairman at Canadian Centre for Food Integrity"}, {"name": "Wendy Ell", "position": "President at Industries in Transition Connection Consulting"}, {"name": "Dr. Guillaume Lhermie", "position": "Director  of the Simpson Centre & Associate Professor at University of Calgary"}]}, {"category": "Tech Triathlon: Quantum + AI + IoT", "title": "Quantum City Challenge: Winner Announcement", "description": "Announcing the winners of the Quantum City Challenge!In November 2023, Quantum City teamed up with Amazon Web Services (AWS), ATCO SpaceLab and Canadian Natural (CNRL) to launch the Quantum City Challenge, a worldwide competition aimed at finding quantum solutions to solve the energy industry's most complex challenges. Join this exciting session to hear how Challenge winners are using quantum computing to address challenges faced by Alberta's energy sector, including innovative approaches to charging optimization, tailings treatment, and bitumen viscosity control. These innovative solutions not only demonstrate the exciting strides made in quantum technology, but also how technology, industry, and innovation can converge to drive economic growth and sustainability in Alberta and around the world.", "speakers": [{"name": "Adam Bene Watts", "position": "Scientist-in-Residence at Quantum City"}, {"name": "Gili Rosenberg", "position": "Senior Applied Scientist at Amazon Quantum Solutions Lab"}, {"name": "JohnPaul Portelli", "position": "Manager - Technology and Innovation at Canadian Natural Resources"}, {"name": "Megan Lee", "position": "Managing Director at Quantum City"}, {"name": "Andrea Klaiber-Langen", "position": "Vice President, Transformation at ATCO"}]}, {"category": "Lethbridge College START Centre: VR Sessions", "title": "Legal Issues Surrounding Agricultural Data", "description": "This session will examine the legal issues surrounding collection, storage, and use of agricultural data.", "speakers": [{"name": "Todd Janzen", "position": "Attorney at Janzen Schroeder Agricultural Law LLC"}]}, {"category": "Tech Triathlon: Quantum + AI + IoT", "title": "Inventures Startup Pitch Competition", "description": "Watch as our five finalists pitch their product or service to our audience of venture capitalists, angel investors, entrepreneurs, early adopters, business educators and service providers. The winning company from each program track will be announced during the Inventures Closing Ceremony on May 31 and receive $10,000!", "speakers": [{"name": "Manpreet Deol", "position": "Venture Investor at Inovia"}, {"name": "Austin Guyette", "position": "Partner at Voyager Capital"}, {"name": "Jay Latta", "position": "Anarchitect at STINT"}]}, {"category": "Tech Triathlon: Quantum + AI + IoT", "title": "Future-Proofing Your Investment in AI: A Guide to Balancing Risk, Compliance, and Speed to Market", "description": "Artificial Intelligence (AI) is poised to be a transformative force across industries, revolutionizing how businesses operate and innovate. However, this rapid evolution brings with it a spectrum of challenges, particularly in managing the delicate balance between risk, privacy, regulatory compliance, and speed to market. Join this session to hear practical advice from industry experts on how to navigate potential pitfalls, make investment decisions, and future-proof your business in the face of the AI frontier. Learn how you can harness the power of AI responsibly, strategically and to achieve a competitive advantage.", "speakers": [{"name": "Dan Semmens", "position": "SVP & Head of Data & AI at ATB"}, {"name": "Claude Théoret", "position": "CEO at X Machina AI"}, {"name": "Stephen Burns", "position": "Partner, Co-Head of Innovation at Bennett Jones"}]}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "Leading the New Healthcare Economy", "description": "Join us for a dynamic panel discussion at the crossroads of innovation, health care, and economic growth. In this session, industry leaders and health care visionaries converge to explore the transformative landscape of the new healthcare economy. Discover how the CAN Health Network bridges the gap between cutting-edge Canadian innovations and health care providers. Together, we will build a healthier, wealthier future.", "speakers": [{"name": "Rhoda Yakubowski", "position": "Director, West & North Regions at CAN Health Network"}, {"name": "An John Nguyen", "position": "Director, Strategic Insights & Company Support at CAN Health Network"}, {"name": "Nella Brodett", "position": "Head of Integrated Markets, Company Support & Partnerships at CAN Health Network"}, {"name": "Megan Leslie", "position": "CEO, Co-Founder at Nanotess Catalytic Solutions"}]}, {"category": "Aspiring Entrepreneurs", "title": "David Bland - Testing Business Ideas", "description": "David Bland, the man who literally wrote ‘the’ book on testing business ideas, will share how some of the top-performing companies on the planet test the desirability, viability and feasibility of ideas for new companies or new products. 100 copies of David's book Testing Business Ideas will be given away to participants of this session.", "speakers": [{"name": "Brandy Old", "position": "Technology Development Advisor at Alberta Innovates"}, {"name": "David Bland", "position": "Founder and Author at Precoil"}, {"name": "Craig Elias", "position": "Entrepreneur-in-Residence at Bow Valley College"}]}, {"category": "Shared Studios: INVENTURE$ Canada Portal", "title": "Powering Africa Through Green Technology", "description": "Step into our portal and meet innovators from around the globe. Engage in real-time conversations with young innovators and faculty at The African Leadership University in Kigali, Rwanda, to learn about how green technology is powering the future of the African continent. From advancements in cooking to water delivery systems, young entrepreneurs share their own green innovations for a more sustainable planet.", "speakers": []}, {"category": "Entrepreneurship", "title": "Behind the Scenes at VC Firms", "description": "If you are an entrepreneur looking for funding, you might wonder what goes on inside a venture capital firm. How do they evaluate your pitch, your team, your product, and your market? What are the steps and stages of their decision-making process?  In this session, you will get a behind-the-scenes look at how VCs operate, from the initial meeting to the final closing.  This session will help you understand the VC perspective and prepare you for your fundraising journey.", "speakers": [{"name": "Nicholas Hyldelund", "position": "Investor at Rhino Ventures"}, {"name": "Maninder Dhaliwal", "position": "Managing Partner at Startup Studio – Accelerator and Venture Fund"}, {"name": "Saif Hashmi", "position": "Principal at  BDC Seed Venture Fund"}, {"name": "Ayo Aiyeleye", "position": "Director, Capital Access at Alberta Innovates"}, {"name": "Tiffany Linke-Boyko", "position": "Investor at Flying Fish Partners"}]}, {"category": "Entrepreneurship", "title": "Playbooks for Growth: Innovative Approaches for Scaling Start-Ups", "description": "Discover the various \"playbooks\" and strategies that can guide your company's growth trajectory, from grassroots community efforts to global market penetration. Whether you're in high-tech or non-technical sectors, this session will equip you with the knowledge to scale your start-up effectively. Learn how to navigate the complexities of growth at different stages and scales, leverage key partnerships and apply these principles to your unique business context. Don't miss the chance to accelerate your start-up's journey from local innovation to international success.", "speakers": [{"name": "Clinton Senkow", "position": "Managing Director, at Senkow Ventures"}, {"name": "Andrea Barzetti", "position": "Managing Director at Almacube"}, {"name": "Iran Karimian", "position": "Head of Accelerator & Startup Ecosystem at Google"}, {"name": "Zack Storms", "position": "Co-Founder at Startup TNT"}, {"name": "Blair Kelsie", "position": "CTO, Owner at Lion Mentorship"}]}, {"category": "Earth Tech: Building Everything Better", "title": "Harnessing Space Technology for Climate Action", "description": "Join us for a session where we will explore the crucial role that space technology plays in combating climate change. Learn about innovative solutions such as Earth observation satellites, remote sensing, and climate monitoring systems, which provide vital data for environmental decision-making. Experts from the space industry, environmental science, and policymaking will discuss the latest advancements, challenges, and opportunities in harnessing space technology for sustainable climate action.", "speakers": [{"name": "Emma Louden", "position": "Astrophysicist at Yale University"}, {"name": "Gabriella Saccocio", "position": "Product Manager at Impact Observatory"}, {"name": "Riyaz Pishori", "position": "Sr. Director PM Research for Industry at Microsoft Research"}]}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "Bridging Health Divides: Innovations for Underserved Communities", "description": "Join us for a conversation on leveraging telehealth, trauma-informed outreach, and digital health solutions to address healthcare disparities in rural, unhouse and underprivileged communities. Gain insights into transformative strategies for improving access and quality of care, ultimately advancing health equity for all.", "speakers": [{"name": "Dr. William Cherniak", "position": "ER MD and Founder / CEO at Rocket Doctor Inc."}, {"name": "Prof. Louis Hugo Francescutti", "position": "Professor at University of Alberta"}, {"name": "Dr. Martin Ferguson-Pell", "position": "Professor at University of Alberta"}, {"name": "Suzanne Buchanan", "position": "Director of the Lethbridge Wellness Shelter Stabilization Unit at BTDH Inc."}, {"name": "Jonathan Payne", "position": "Lethbridge Shelter and Stabilization Coordinator at Blood Tribe Dept. of Health"}]}, {"category": "Earth Tech: Building Everything Better", "title": "Lessons from Leaders: Providing Secure, Reliable, Net-Zero Energy", "description": "Canada's ambitious GHG emission reduction target is 40% by 2030, with the ultimate goal of net-zero emissions by 2050. Regulatory, supply chain and skilled labour shortages only compound the complexities of providing clean, secure, and reliable energy for Alberta, Canada, and beyond. Come hear from Alberta’s energy leaders on how clean technology can help provide affordable, reliable, and secure energy as we move toward a net-zero emissions economy.", "speakers": [{"name": "Dan Balaban", "position": "CEO & Executive Chair at Greengate Power Corporation"}, {"name": "Martha Hall Findlay", "position": "Director at School of Public Policy, University of Calgary"}, {"name": "Mark Poweska", "position": "President & CEO at ENMAX Corporation"}, {"name": "Jeff Lawson", "position": "Senior Vice-President, Corporate Development & Acting Chief Sustainability Officer at Cenovus"}]}, {"category": "Growing Up: Food Tech Farm to Fork", "title": "From Bytes to Bites: Rebooting the Agri-Food Sector", "description": "The agri-food sector stands at a critical juncture: tasked with producing more food sustainably in an ever-shifting landscape of finite resources. However, amidst these challenges emerges the transformative potential of data and digital technologies. These innovations stand ready to cultivate a new era in our agricultural and food systems, promising growth, resilience, and sustainability. At the heart of this digital revolution lies the prospect of better decision-making, with promises of reduced transaction costs, streamlined processes, and equitable access to vital information for all stakeholders. Yet, as we delve into the realm of digital agriculture, questions arise: Is it truly a reality? Is its adoption widespread across the agri-food value chain? Do the bytes of data translate into tangible bites of progress? Expert panelists delve deep into these inquiries, exploring the intersection of innovation, sustainability, and success within one of the world's oldest industries. Join us as we examine the imperative for adopting and validating new technologies and ponder whether the agri-food sector requires a profound reboot to secure its future in an ever-evolving landscape.", "speakers": [{"name": "Dana McCauley", "position": "CEO at Canadian Food Innovation Network"}, {"name": "Jonathan McFadden", "position": "Research Economist at U.S. Department of Agriculture"}, {"name": "Jacqueline Keena", "position": "Managing Director at EMILI"}, {"name": "Dr. Joy Agnew", "position": "Vice President Research, Executive Offices at Olds College"}, {"name": "Dr. Godard", "position": "COO at Verge Agriculture"}]}, {"category": "Tech Triathlon: Quantum + AI + IoT", "title": "AI & Automation: Transforming Businesses, Productivity and Growth", "description": "Automation and artificial intelligence have the potential to play a transformational role in business, productivity, and economic growth. These technologies will also transform our workplaces, homes, and society more broadly. Join this session to hear from experts on how accelerating progress in AI and automation is creating innovative business opportunities, affecting the way we work, and presenting key challenges that will need to be overcome to maximize the potential of these exciting technologies.", "speakers": [{"name": "Jorge Muñoz", "position": "Co-Founder and CCO at Unmanned Life"}, {"name": "Doug Schweitzer", "position": "Founding Partner at Blue Rock Law"}]}, {"category": "Lethbridge College START Centre: Metaverse Mentoring", "title": "Lethbridge College START Centre: Metaverse Mentoring", "description": "Visit our Metaverse Mentoring room at INVENTURES, where attendees can immerse themselves in a variety of immersive prototype experiences. Engage with lead researchers and discover how immersive technologies can transform your organization. Whether you're curious about the latest advancements or seeking expert advice on your spatial technology ideas, our team is ready to guide you. Explore, learn, and unlock the potential of the spatial technologies for your business.", "speakers": []}, {"category": "Lethbridge College START Centre: VR Sessions", "title": "Lethbridge College START Centre: VR Sessions", "description": "Step into our VR Sessions room at INVENTURES and dive into a world of social VR. Experience the power of virtual events and connect with people across geographic distances. Hear from speakers from around the world who will share their expertise without the need to travel. This room demonstrates the immense value of social VR, showcasing how it can bring people together, foster collaboration, and create meaningful connections regardless of location.", "speakers": []}, {"category": "Lethbridge College START Centre: Spatial Tech Experimentation", "title": "Lethbridge College START Centre: Spatial Tech Experimentation", "description": "Step into our cutting-edge technology showcase room at INVENTURES and experience the future firsthand. Our room features the Varjo XR-4 headset, offering unmatched virtual and mixed reality with its high resolution and advanced eye-tracking. Feel the thrill of realistic driving with our motion driving simulator and explore the precision of our latest scanning technology. Get hands-on with the Alberta-made Peregrine Glove, a revolutionary input device transforming how we interact with digital environments. Discover the immense potential of these technologies and learn how the Spatial Technologies Applied Research and Training (START) Centre can help turn visionary possibilities into reality.", "speakers": []}, {"category": "Tech Triathlon: Quantum + AI + IoT", "title": "Enabling the Energy Transition with CleanAI", "description": "Will AI be a force multiplier or a hindrance to the clean economy transition? Join this session to explore how we ensure it's the former, with leaders investing in and deploying cleanAI solutions.", "speakers": [{"name": "Ha Nguyen", "position": "Partner at McRock Capital"}, {"name": "Nicholas Parker", "position": "Chair and Founder at CleanAI Initative"}, {"name": "Devesh Bharadwaj", "position": "Founder & CEO at Pani"}, {"name": "Dyrell Chapman", "position": "Co-Founder / CTO at Demia"}]}, {"category": "Entrepreneurship", "title": "Master Mentor Program (Private Event)", "description": "Designed to facilitate connections between expert advisors and the next generation of tech companies, the Master Mentors program runs May 29 and 30 during the Inventures conference. Registered Inventures attendees can tap into a network of advisors who are ready to guide you on your next business move or strategic connection.", "speakers": []}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "Announcement: AI for Better Health", "description": "Join Alberta Innovates as they announce the successful projects, worth $9.5 million, from the AI for Better Health program.  NOTE:  Seating is limited", "speakers": []}, {"category": "Lethbridge College START Centre: VR Sessions", "title": "Bridging Healthcare & Innovation: How Generative AI Revolutionises Social Connectedness", "description": "In this session, I am exploring the transformative role of generative AI in addressing social isolation within healthcare through the lens of Conversational Virtual Humans (CVHs). This concise exploration, grounded in a multiple-case study, highlights the creation of empathetic, AI-driven companions that offer support and engagement to isolated individuals. I delve into the technical innovations and ethical considerations behind CVHs, showcasing their impact on enhancing user experience/patient care and fostering a more inclusive healthcare ecosystem. Join us for a compelling presentation of how generative AI and Conversational Virtual Humans are not just reshaping the future of healthcare but are also redefining the essence of human connection in the digital age.", "speakers": [{"name": "Anna Xygkou", "position": "PhD Researcher at University of Kent"}]}, {"category": "Lunch & Networking", "title": "Networking Lunch", "description": "An elevated bento box lunch will be available for pick up in Hall E and the Macleod Foyer area. Grab your lunch and take a stroll around the conference centre to visit the exhibitors and experiential elements of Inventures.", "speakers": []}, {"category": "Shared Studios: INVENTURE$ Canada Portal", "title": "Transforming Waste Into Sustainable Housing", "description": "Step into our portal and meet innovators from around the globe. Engage in real-time conversations with entrepreneurial refugees from Opportunigee, in Nakivale, Uganda, to explore how they are recycling waste into sustainable housing using recycled bottle bricks.", "speakers": []}, {"category": "Keynote", "title": "Book Signing: David Bland", "description": "7 out of 10 new products fail to deliver on expectations. Testing Business Ideas aims to reverse that statistic. In the tradition of Alex Osterwalder’s global bestseller Business Model Generation, this practical guide contains a library of hands-on techniques for rapidly testing new business ideas. \nTesting Business Ideas explains how systematically testing business ideas dramatically reduces the risk and increases the likelihood of success for any new venture or business project. It builds on the internationally popular Business Model Canvas and Value Proposition Canvas by integrating Assumptions Mapping and other powerful lean startup-style experiments. \nA definitive field guide to business model testing, this book features practical tips for making major decisions that are not based on intuition and guesses. Testing Business Ideas shows leaders how to encourage an experimentation mindset within their organization and make experimentation a continuous, repeatable process. \nJoin us for a book signing with David Bland, featuring his new book, “Testing Business Ideas”.", "speakers": [{"name": "David Bland", "position": "Founder and Author at Precoil"}]}, {"category": "Pop-Up Q&A", "title": "Pop-Up Q&A", "description": "Are you ready to connect with the brightest minds, industry leaders, venture capitalists and entrepreneurs who are solving the most critical issues of our time? Look no further! Our exclusive pop-up Q&A brings together thought leaders from across the globe for a quick and insightful talks followed by a rapid fire, interactive audience Q&A. Don't miss out on the opportunity to gain direct access to the movers and shakers advancing innovation!", "speakers": [{"name": "Justin Riemer", "position": "CEO at Emissions Reduction Alberta"}, {"name": "Mina Zarabian", "position": "CEO & Co-Founder at Carbonova"}]}, {"category": "Featured", "title": "Humanity Meets Machine: Interview with a Robot", "description": "Ameca is the world’s most advanced human shaped robot. Integrating both artificial intelligence (AI) and artificial body (AB), Ameca represents a perfect platform to better understand how machines can live with us, collaborate with us, and enrich our lives today and in the future. Join this session to witness Ameca live in conversation with Alberta Innovates CEO Laura Kilcrease, as we uncover the power of the humanity-technology nexus.", "speakers": [{"name": "Ameca Robot", "position": "The Future Face of Robotics at Engineered Arts"}, {"name": "Darrell Brertton", "position": "Saddle Lake Cree Nation"}, {"name": "Laura Kilcrease", "position": "Chief Executive Officer at Alberta Innovates"}]}, {"category": "Lethbridge College START Centre: VR Sessions", "title": "Navigating the Lived Experience of Data: Insights in a Digital Age", "description": "We live in a data-rich environment, a world where we've crossed boundaries through technological advancements. What are digital users' lived experiences of never-ending streams of information? How are people's lives changed and their behaviour affected? How are businesses doing in their digital transformation journeys? Just a few thought-provoking questions on navigating the impact of data on individuals, businesses, and society.", "speakers": [{"name": "Andrew de Juan", "position": "Researcher at Munster Technological University"}]}, {"category": "Networking", "title": "Networking Break", "description": "Refreshments will be available in all pre-function areas of the conference centre throughout the event, including during networking breaks.   Grab a drink and a snack in the Exhibition Hall Foyer, Macleod Foyer, Telus Foyer, or Glen Foyer. This is a great opportunity to visit the exhibitors and experiential elements of Inventures.", "speakers": []}, {"category": "Entrepreneurship", "title": "Valuations Unveiled: Navigating the Numbers", "description": "Valuation is a key concept for founders who want to raise funds from investors, but it can also be a source of confusion and misunderstanding. This session will explain what valuation means, how it is calculated, and how to use it effectively in negotiations with investors. You will learn how to communicate your value proposition and justify your valuation to potential investors.", "speakers": [{"name": "Kristina Milke", "position": "General Partner at Sprout Fund"}, {"name": "Kimberley Nixon", "position": "Investor at Open Venture Capital"}, {"name": "Lise  Birikundavyi", "position": "Managing Partner at BKR Capital"}, {"name": "Peter Santosham", "position": "Executive Director of Seed Funds at UCeed Startup Invenstment Funds"}]}, {"category": "Growing Up: Food Tech Farm to Fork", "title": "Inventures Startup Pitch Competition", "description": "Watch as our five finalists pitch their product or service to our audience of venture capitalists, angel investors, entrepreneurs, early adopters, business educators and service providers. The winning company from each program track will be announced during the Inventures Closing Ceremony on May 31 and receive $10,000!", "speakers": [{"name": "Dania Moazzam", "position": "VP Banking at RBCx"}, {"name": "Chris Paterson", "position": "Tall Grass Ventures"}, {"name": "Jim Hardin", "position": "Managing Partner at Carrot Ventures"}, {"name": "Victoria Bennett", "position": "Founder & CEO at The Crowfunding Hub"}]}, {"category": "Tech Triathlon: Quantum + AI + IoT", "title": "Navigating the Cutting Edge: Risks, Predictions, and Quantum Challenges", "description": "Join us for a session delving into the risks and challenges of the AI revolution, the capabilities of predictive AI and IoT solutions, and the founding challenges of quantum tech companies. Walk away with a comprehensive understanding of navigating the cutting edge and driving success in the rapidly evolving tech landscape.", "speakers": [{"name": "Oscar Cruz", "position": "CTO at Bow River Solutions"}, {"name": "Dr. Katanya Kuntz", "position": "CEO & Co-founder at Qubo Consulting Corp."}, {"name": "Christopher Cassin", "position": "CEO  at Zero Point Cryogenics"}]}, {"category": "Shared Studios: INVENTURE$ Canada Portal", "title": "Afrofuturism", "description": "Step into our portal and meet innovators from around the globe. Engage in real-time conversations with members of Instituto Chegados and Trails of Oyá directly from São Vicente, Brazil, to explore how they are revitalizing Afro-Indigenous traditions to inspire their community to live in harmony with Mother Nature.\"The Trails of Oyá is an initiative to awaken our ancestry and ancient knowledge in constant motion. It represents a return to our roots by walking with nature and breaking the vicious and limiting cycles that have been imposed on us by the society we live in, distancing us from living in harmony with Mother Nature. We seek to connect with our spirituality through knowledge from Afro-Indigenous traditions.\"", "speakers": []}, {"category": "Entrepreneurship", "title": "The Magic of Mentorship and the Journey to Building a Tech Giant in Canada", "description": "Our goal is to highlight the journey to scale and what it takes to get there. At InterGen, we focus on connecting entrepreneurs with business leaders that can help them navigate the challenges founders face with rapid growth. Breanne and Hanif have surrounded themselves with mentors and sponsors that have supported them along the way. Raising scale capital is particularly hard, and more so in Calgary. Our panel will highlight the challenges and benefits of building and investing in Calgary tech and taking their products and services outside of Canada. We will also explore the \"flywheel effect\" as successful founders start to invest in those following them.", "speakers": [{"name": "Hanif Joshaghani", "position": "Co-Founder and CEO at Symend"}, {"name": "James Lochrie", "position": "Partner at Thin Air Labs"}, {"name": "Sandi Gilbert", "position": "Managing Partner at InterGen"}, {"name": "Vincent Ircandia", "position": "Founder and CEO at StellarAlgo"}]}, {"category": "Aspiring Entrepreneurs", "title": "Getting Unstuck Panel with Wilson Acton", "description": "Moderated by Venture Capitalist Wilson Action, this panel features four highly successful entrepreneurs sharing their before and after stories of how they pivoted their company to get unstuck and the success they had after they pivoted.", "speakers": [{"name": "Derek Rucki", "position": "Co-Founder at Inspired Go"}, {"name": "Graham Sherman", "position": "President & Founder at Tool Shed Brewing Company"}, {"name": "Alice Reimer", "position": "CEO at Fillip Fleet"}, {"name": "Wilson Acton", "position": "Managing Partner at Tall Grass Ventures"}, {"name": "Laura Fortey", "position": "COO & Co-Founder at REITIUM"}]}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "Innovation, Intelligence, Investment: Unlocking the Future of Women's Health", "description": "Women’s health is being left behind. It is time to create a global competition to advance technologies, practices, and parity. Women can take more authority of their health experience and the system can be more open, accessible and modern, to meet women’s health needs. Innovation, intelligence and investment will improve health outcomes and accelerate advancements in women’s health around the globe.", "speakers": [{"name": "Carmen Wyton", "position": "Founder & Chair at Women's Health Coalition of Canada"}, {"name": "Reg Joseph", "position": "CEO at Health Cities"}, {"name": "Dr. Erin Brennand", "position": "Department Head, Obstetrics & Gynecology at University of Calgary & Alberta Health Services - Calgary Zone"}, {"name": "Loreen Wales", "position": "CEO at My Viva Inc."}]}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "Health Data Privacy: An Age of Innovation and Reform", "description": "Like many provinces and territories in Canada, Alberta has taken an active approach enacting legislation that governs and regulate user access, collection, and disclosure of health data information. Discover how legislative reforms are shaping the landscape, and the pivotal role you can play in securing health data for generations to come.", "speakers": [{"name": "Rohit Joshi", "position": "Co-Founder and CEO at BrightSquid Communications Corp"}, {"name": "Diane McLeod", "position": "Information and Privacy Commissioner at Office of the Information and Privacy Commissioner of Alberta"}, {"name": "Stephen Samis", "position": "Board Chair at Imagine Citizens Network"}, {"name": "Sandra Stabel", "position": "Director, Health Innovation Partnerships & Strategy at Government of Alberta"}]}, {"category": "Growing Up: Food Tech Farm to Fork", "title": "Next Generation Food Solutions: AI and Digital Innovations", "description": "Join us for an enlightening session delving into the cutting-edge realm of next-generation food solutions. Discover how strategic investments, collaboration, mentorship, and the commercialization of technology are propelling efficiency and innovation in the agri-food sector across Canada and globally. Our panel of experts will explore the dynamic landscape of AI integration, digitization, and technological advancement reshaping food production.", "speakers": [{"name": "Hubba Khatoon", "position": "Regional Innovation Director - Prairies at Canadian Food Innovation Network"}, {"name": "Fernando Spilki", "position": "Full Professor at Feevale University, Brazil"}, {"name": "Shawn Leggett", "position": "President & Founder at GroundUp Eco-Ventures"}, {"name": "Ravneet (Rav) Singh", "position": "Subject Matter Expert  at Embedded, Cloud Technology"}]}, {"category": "Earth Tech: Building Everything Better", "title": "The Power of Retrofit: Reducing Emissions from Existing Infrastructure", "description": "To achieve carbon-neutral targets, the use of hydrogen-fueled vehicles, electricity, and heating is necessary. However, investing in new vehicles and building infrastructure can be costly and time-consuming. In some cases, retrofitting existing infrastructure is a more practical and affordable solution. This will enable fleet operators, utilities, and building owners to make progress toward carbon-neutral targets in a shorter period of time.", "speakers": [{"name": "Grace Meikle", "position": "Director, Technology Impact at Emissions Reductions Alberta"}, {"name": "Rebecca Goldsack", "position": "COO at Diesel Tech Industries Ltd."}, {"name": "Justin Pullukatt", "position": "Director, Hydrogen Projects & Technology Development at ATCO"}, {"name": "Wray Sparling", "position": "Senior Fleet Engineer at City of Calgary, Fleet & Inventory"}]}, {"category": "Entrepreneurship", "title": "Applied Education for Business Innovation", "description": "Entrepreneurs, startups, and established companies are constantly seeking novel ways to propel their businesses forward. Meanwhile, business students—immersed in their academic journey—are amassing new ideas, fresh perspectives, and a keen understanding of emerging technologies. Join us to hear from companies, graduates, and applied education experts alike on how partnering with post-secondaries can help your organization attack problems and opportunities from new, innovative angles, and bring your business to the next level.", "speakers": [{"name": "Daylon Nicol", "position": "Marketing & Design at Doots"}, {"name": "Erika Mahoney", "position": "Client Lead, J5 Design"}, {"name": "Sonja Johnston", "position": "Instructor & Capstone Lead, SAIT School of Business at SAIT School of Business"}, {"name": "Gursher Pannu", "position": "Associate Dean – Program Excellence, School of Business at SAIT"}]}, {"category": "Blurring Boundaries", "title": "Infinite Possibilities: Indigenous Entrepreneurship", "description": "Join us for an inspiring exploration of Indigenous entrepreneurship—a dynamic force that transcends boundaries and redefines what’s achievable. In this panel, visionary Indigenous leaders, trailblazers, and change-makers will share their stories, weaving together tradition, innovation, and resilience. Discover how Indigenous knowledge shapes thriving businesses, fosters social impact, and unlocks infinite possibilities for economic growth. Let’s celebrate the spirit of entrepreneurship rooted in culture, guided by wisdom, and fueled by boundless potential.", "speakers": [{"name": "Darren Rea", "position": "Artist / Creator / Entrepreneur at Maskwa Mitehi"}, {"name": "Elder Alvin Manitopyes", "position": "Owner Operator at EarthCode Tours"}, {"name": "Melrene Saloy", "position": "CEO & Designer at Native Diva Creations"}, {"name": "Kenneth Letander", "position": "Chief Executive Officer at Strat First Inc."}]}, {"category": "Growing Up: Food Tech Farm to Fork", "title": "EcoHarvest: Bridging Energy and Agriculture with Green Innovations", "description": "Gain insights into bridging the gap between green energy and agricultural practices. As we discuss biomass energy and aquaponic advancements, offering strategies for sustainable energy and agriculture, participants will walk away with actionable ideas for a greener future in both sectors.", "speakers": [{"name": "Dr. Nick Savidov", "position": "Senior Research Scientist at Lethbridge College"}, {"name": "Kari McDonald", "position": "CEO at BioEnergy Solutions"}, {"name": "Diane Gray", "position": "President at Prairies Economic Development Canada"}]}, {"category": "Earth Tech: Building Everything Better", "title": "Hungry for Hydrogen: Credible Opportunities for Technology Scale-Up", "description": "Global interest in hydrogen is accelerating, and there is a race underway to develop needed technologies, deploy them at scale, and export to hungry markets. With use cases across petrochemicals, power, mobility and heat, hydrogen has potential to meet demand across numerous applications, while helping to meet net-zero emissions targets. However, this broad potential has resulted in significant hype surrounding production, end uses, and export opportunities. Join this session to explore the credible applications for hydrogen, where the true investment opportunities lie, and how we can develop the ecosystem, supply chains, and public support required to de-risk and scale up this critical technology.", "speakers": [{"name": "Heather Herring", "position": "CEO at Make It So Inc."}, {"name": "Matt Desroches", "position": "Co-founder & COO at Innova Hydrogen"}, {"name": "Dave Van Den Assem", "position": "Director, Clean Technology, Alberta Hydrogen Centre of Excellence at Alberta Innovates"}, {"name": "Jennifer Doepker", "position": "Vice President at Gradient Thermal"}]}, {"category": "Tech Triathlon: Quantum + AI + IoT", "title": "Demystifying the Gaming Investment Landscape", "description": "Join industry experts as they highlight the economic impact of the $200B gaming industry. Speakers will provide global and local context on the gaming sector, dig into current investment trends, and highlight where the industry is going and what the potential is for Alberta.", "speakers": [{"name": "Jason Della Rocca", "position": "Co-Founder at Execution Labs"}, {"name": "Ibrahim Hafeez", "position": "Investor at Griffin Gaming Partners"}, {"name": "Alexandra Cutean", "position": "Chief Research Officer at Information and Communications Technology Council (ICTC)"}]}, {"category": "Lethbridge College START Centre: VR Sessions", "title": "Can Gamers Fill the Operator Shortage? The Impact of Simulation on Workforce Gaps", "description": "Simulators are developed for various purposes, one of which is to attract young people to operate equipment in industries facing significant and growing shortages. Across different machines and sectors, the rapid adoption of technology in operator cabs is evident. Gamers, with their inherent skills, can easily transition to mastering the operation of complex machinery. However, the question remains: once trained, will they find satisfaction in the demanding daily work it entails?", "speakers": [{"name": "Renee Gorrell", "position": "CEO at CSE Software Inc."}]}, {"category": "Networking", "title": "Networking Break", "description": "Refreshments will be available in all pre-function areas of the conference centre throughout the event, including during networking breaks.   Grab a drink and a snack in the Exhibition Hall Foyer, Macleod Foyer, Telus Foyer, or Glen Foyer. This is a great opportunity to visit the exhibitors and experiential elements of Inventures.", "speakers": []}, {"category": "Tech Triathlon: Quantum + AI + IoT", "title": "Quantum Leaps: Riding the S-Curve of Infinite Possibilities", "description": "Quantum leaps in progress happen when emerging technologies intersect to create disruption. Today, technologies like AI, computational biology, green energy, new space, and quantum computing are intersecting with more mature technologies like the cloud and semiconductors. Synchronous technological development can lead to significant disruption, like the intersections of smartphones and the cloud, or personal computers and the internet. In this session, we’ll explore how innovators across industries are responding to this fast-paced landscape. We’ll consider what these new technologies bring in terms of applications and services, and how AI and its intersection with other emerging technologies has the potential to create disruptive breakthroughs that will change the course of our future.", "speakers": [{"name": "Michael Piriano", "position": "Chief Operating Officer at ORCA Computing"}, {"name": "Chris Robson", "position": ""}, {"name": "Austin Guyette", "position": "Partner at Voyager Capital"}]}, {"category": "Entrepreneurship", "title": "Technology Roadmap for Scaling a Tech Company", "description": "What are the essentials of scaling your tech startup? Whether you're at the initial stages or already on the path to growth, this session is your gateway to equipping yourself with the vital knowledge and tools essential for thriving in the competitive tech landscape. Discover the key strategies and resources needed to prepare for growth and expansion by hearing from professionals who have successfully scaled tech companies.", "speakers": [{"name": "Dr. Simon Raby", "position": "Founder & Architect, Growth Catalyst & Associate Director at Institute for Innovations & Entrepreneurship, Mount Royal University"}, {"name": "Amina Tariq", "position": "SVP of Product and Client Experience at PurposeMed"}, {"name": "Shubh Sidhu", "position": "SVP of Strategy + GM of Canada at ZayZoon"}]}, {"category": "Entrepreneurship", "title": "Investing Unleashed: Transforming Capital and Models for Entrepreneurs and Startups", "description": "Speakers will address challenges in raising capital and navigating securities laws, redefining traditional investment models, and democratizing investing with modern asset allocation strategies. Attendees will gain a comprehensive understanding of how to revolutionize investment approaches for a more inclusive financial future.", "speakers": [{"name": "Matthew Wilson", "position": "Founder & Managing Director at Allied Venture Partners"}, {"name": "Reece Tomlinson", "position": "Founder & CEO at RWT Growth Inc."}, {"name": "Andrew Goldner", "position": "Founding Partner at GrowthX"}]}, {"category": "Earth Tech: Building Everything Better", "title": "Inventures Startup Pitch Competition", "description": "Watch as our five finalists pitch their product or service to our audience of venture capitalists, angel investors, entrepreneurs, early adopters, business educators and service providers. The winning company from each program track will be announced during the Inventures Closing Ceremony on May 31 and receive $10,000!", "speakers": [{"name": "Hari Balasubramanian", "position": "Founding Managing Partner at EcoAdvisors Incorporated"}, {"name": "Akhil Abat", "position": "Board Member & Venture Partner at Kinitics Automation, NGIF Capital"}, {"name": "Todd Allmendinger", "position": "Cleantech Group at Director of Consulting and Research"}, {"name": "Shay Natarajan", "position": "Partner - Strategy at Mobility Impact Partners"}]}, {"category": "Lethbridge College START Centre: VR Sessions", "title": "A Post-Pandemic Overview of the Immersive Healthcare Landscape and Market", "description": "The state of the immersive healthcare market over the last three years since the end of pandemic and expectations for the next 18-24 months.", "speakers": [{"name": "Robert Fine", "position": "Executive Director at IVRHA (International Virtual Reality and Healthcare Association)"}]}, {"category": "Shared Studios: INVENTURE$ Canada Portal", "title": "Creating Sustainable Supply Chains", "description": "Step into our portal and meet innovators from around the globe. Engage in real-time conversations with experts from WIRRED and Slow Food Barbados to discuss climate change. Learn about the role of agritourism in reshaping the supply chain in Barbados, a country where nearly 80% of all food is imported. Discover how the slow food movement is disrupting food systems for a more sustainable planet!", "speakers": []}, {"category": "Earth Tech: Building Everything Better", "title": "Carbon Solutions Summit: Advancing Sustainability in Construction", "description": "Explore forward-looking strategies for reducing carbon emissions in construction with experts in circular economy principles, carbon capture in building materials, emission accounting, and pipeline transportation challenges. Discover the opportunities for advancements in construction through AI innovation. Join us to uncover innovative solutions driving sustainability in the built environment and pave the way for a greener future.", "speakers": [{"name": "Doug Brown", "position": "CTO at ZS2 Technologies Ltd."}, {"name": "Melvin Newman", "position": "CEO & Co-Founder  at Patabid"}, {"name": "Alireza Kaboorani", "position": "Director, Building Efficiency Technology Access Centre (BETAC) at Red River College Polytechnic (RRC Polytech)"}, {"name": "Pamela Goertzen", "position": "Executive Director at SSRIA"}, {"name": "Cody Austin", "position": "COO and Co founder at Digital Carbon Bank"}]}, {"category": "Aspiring Entrepreneurs", "title": "Student Pitch Competition Preliminary Round #1", "description": "The student pitch competition helps promising student entrepreneurs and recent alumni from post-secondary institutions across Canada gain the exposure, feedback, and resources that their business idea needs to succeed.During the preliminary rounds of the student pitch competition, six contestants are given four minutes each to dazzle a live audience and a panel of judges with their ideas, innovations, products, and/or services.At the end of the second day, the six finalists from the two preliminary rounds will pitch to early-stage investors from the United States and Canada.The top three will be announced during the closing ceremonies on Friday afternoon.", "speakers": [{"name": "Heather Herring", "position": "CEO at Make It So Inc."}, {"name": "Craig Elias", "position": "Entrepreneur-in-Residence at Bow Valley College"}, {"name": "Kara Johnston", "position": "Technology Development Advisor at Alberta Innovates"}, {"name": "Joanne Fedeyko", "position": "CEO & Founder at Connection Silicon Valley"}, {"name": "Devon Wannop", "position": "Consultant/ Fractional CFO at IG Wealth Management"}]}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "Democratizing Healthcare through AI", "description": "How are AI-based technologies addressing the shortage of skilled workers, rising costs, and the challenge of reaching under-served communities while meeting ethical standards for privacy, bias, and inclusion? Our panel will highlight breakthrough technologies and discuss how responsible use of AI can revolutionize healthcare delivery, improve quality of care, and build more resilient health systems.", "speakers": [{"name": "Dr. Ilker Hacihaliloglu", "position": "Co-Founder/CTO PONS, Professor at The Univeristy of British Columbia at PONS, UBC"}, {"name": "Taylor McPartland", "position": "CEO at ScaleHealth"}, {"name": "Ian Bergman", "position": "Alchemist Accelerator at Managing Director"}, {"name": "Gülin Yilmaz", "position": "Co-founder & CEO at Rosette Health"}]}, {"category": "Entrepreneurship", "title": "Accelerating Scaleup: Poly Technical Applied Research", "description": "Innovation, collaboration and pushing your product across the finish line is what Alberta’s poly techs applied research centres do! Alberta’s critical industry challenges are getting innovative solutions, technological break throughs and productivity efficiencies by working with the Poly Tech Applied Research Institutes. These cutting-edge facilities provide access to equipment and skilled research teams where collaborations lead companies to new opportunities for growth, market expansion and revenue generation.", "speakers": [{"name": "Jamie McInnis", "position": "Director,  Applied Research & Innovation Services at SAIT"}, {"name": "Olle Lagerquist", "position": "AVP-Industry Solutions at NAIT"}, {"name": "Sivagowry Lewis", "position": "Dean Applied Research at Northwestern Polytechnic"}, {"name": "Crys Vanier", "position": "Executive Director, Post Secondary Investments and Emerging Technologies , Post-Secondary Investment at Alberta Innovates"}, {"name": "Patrick Machacek", "position": "VP Development and Partnerships at Red Deer Polytechnic"}]}, {"category": "Tech Triathlon: Quantum + AI + IoT", "title": "Deciphering Reality: Ethics and Truth in the Age of Deepfakes", "description": "While the act of creating fake content is not new, deepfakes leverage powerful techniques from machine learning and artificial intelligence to manipulate or generate visual and audio content that can more easily deceive. Deep fakes, social influencers, and scientists are in a battle that is redefining how facts are revealed, opinions are formed and truth is understood. Communities of interest are being shaped and mobilized across omni-media channels, geographic boundaries and institutions. Where and how do algorithms impact human ethics in both virtuous and vicious cycles of misinformation and disinformation?", "speakers": [{"name": "Peter Pilarski", "position": "Founder at Tourism AI Network"}, {"name": "Dr. Marina Gavrilova", "position": "Professor and Research Excellence Chair at Faculty of Science, University of Calgary"}, {"name": "Amy Peck", "position": "CEO at EndeavorXR"}]}, {"category": "Growing Up: Food Tech Farm to Fork", "title": "Smart Farm Networks: Scaling up On-Farm Digital Solutions", "description": "Smart farm networks leverage technologies like the Internet of Things (IoT), robotics, drones, and artificial intelligence (AI) to help producers manage farms more efficiently, increase output, and reduce environmental impacts. Countries around the world are recognizing the opportunity to scale up and implement new digital and autonomous tools in the agriculture sectors. Join this session to learn how smart farm networks in Canada and around the world are collaborating to scale up these innovative solutions and accelerate on-farm adoption.", "speakers": [{"name": "Andrea Johnston", "position": "Assistant Deputy Minister at ISED-Government of Canada"}, {"name": "Nick Pagett", "position": "Executive Director of AgriPark at Charles Sturt University"}, {"name": "Adrienne Levay", "position": "Instructor & Researcher, Agriculture Technology & Applied Research at Lakeland College"}, {"name": "Dr. Trisha Toop", "position": "Delivery Director at UK Agri-Tech Centre"}]}, {"category": "Networking", "title": "Inventures Welcome Reception", "description": "Embark on a sensory journey where culinary arts and scientific innovation converge.  Be welcomed by our elegant floor-based acrobats and prepare for an evening of delicious surprises and engaging entertainment. Experience the magic of science in cuisine with our unique stations. Enjoy liquid nitrogen ice cream, balsamic pearls made with agar agar, and explore flavors enhanced by modern techniques like compression and curing. Each station also provides insights into the preparation methods behind these innovative dishes.  Entertainment and Activities include:  Silent Disco: Choose your tunes and dance freely at our silent disco featuring two dynamic DJs.  360 Photo Booth: Capture fun moments from every angle with the 360 photo booth sponsored by Event Combo.  EZRobotics Showcase: Check out the latest in technology with a 3D printed robot from EZRobotics.  Receive one free drink ticket to enjoy a refreshing cocktail of your choice.  Join us for an unforgettable evening of taste exploration and technological marvels, perfect for food lovers and tech enthusiasts alike.", "speakers": []}, {"category": "Registration", "title": "Registration", "description": "Badge collection is available in the Exhibition Hall Foyer area of the convention centre. This is for delegates who have registered online and purchased a ticket for Inventures in advance using our online registration system.   STUDENTS AND MEDIA: Badge collection for students and media is available at the kiosk window/counter just inside the ground-level entrance to the convention centre North Building, just beyond the convention centre information desk. Student ID or Media Accreditation must be shown to collect your badge.  ONSITE TICKET PURCHASE: If you need to purchase a ticket onsite, we encourage you to use the online registration link available on the Inventures 2024 website using your smartphone or laptop. You can then pick up your badge at registration. Should you require assistance with the onsite purchase of tickets, please visit the kiosk window/counter just inside the ground-level entrance to the convention centre North Building, just beyond the convention centre information desk. Onsite ticket purchase is not available at any other location.", "speakers": []}, {"category": "Breakfast & Networking", "title": "Breakfast Bites & Networking", "description": "Join us for coffee, light breakfast bites, and networking before the start of Inventures programming, available in the Exhibition Hall Foyer, Hall E, and the Macleod Foyer.", "speakers": []}, {"category": "Networking", "title": "Connection Hub at The Colab: powered by University of Alberta", "description": "Looking for a quiet place to have a 1:1 chat? This is your space. Welcome to Connection Hub at The Colab, your spot for one-on-one discussions at Inventures. Designed for intimate networking and collaboration, this space accommodates up to 11 pairs at a time, ensuring meaningful interactions and focused conversations. Engage directly with members of the University of Alberta team, share insights, explore potential collaborations, and discuss future opportunities. Activated by University of Alberta as part of their sponsorship, this hub serves as a focal point for innovation and partnership.", "speakers": []}, {"category": "Featured", "title": "Cities of the Future", "description": "Join Calgary Mayor Jyoti Gondek and Edmonton Mayor Amarjeet Sohi, as they explore how Alberta’s biggest cities can embrace innovation and deploy technologies in becoming cities of the future. How can municipalities, citizens, business leaders, investors and entrepreneurs work to create the environment needed to grow local success stories and attract outside investment? How are cities themselves adopting innovation to prepare for future growth?", "speakers": [{"name": "The Honourable Jyoti Gondek", "position": "Mayor of Calgary at City of Calgary"}, {"name": "The Honourable Amarjeet Sohi", "position": "Mayor of Edmonton at City of Edmonton"}, {"name": "Leann Hackman-Carty", "position": "CEO at Economic Developers Alberta"}]}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "PanOMiq Announcement", "description": "Join Dr. Anmol Kapoor as he and the team announce the launch of PanOmiQ- the World's Fastest Genomic Analysis Software.", "speakers": []}, {"category": "Networking", "title": "Networking Break", "description": "Refreshments will be available in all pre-function areas of the conference centre throughout the event, including during networking breaks.   Grab a drink and a snack in the Exhibition Hall Foyer, Macleod Foyer, Telus Foyer, or Glen Foyer. This is a great opportunity to visit the exhibitors and experiential elements of Inventures.", "speakers": []}, {"category": "Pop-Up Q&A", "title": "Pop-Up Q&A", "description": "Are you ready to connect with the brightest minds, industry leaders, venture capitalists and entrepreneurs who are solving the most critical issues of our time? Look no further! Our exclusive pop-up Q&A brings together thought leaders from across the globe for a quick and insightful talks followed by a rapid fire, interactive audience Q&A. Don't miss out on the opportunity to gain direct access to the movers and shakers advancing innovation!", "speakers": [{"name": "Laura Kilcrease", "position": "Chief Executive Officer at Alberta Innovates"}]}, {"category": "Ancillary Pitch Programming", "title": "Plug and Play AI in Energy Innovation Challenge", "description": "With the world’s population projected to hit 10 billion by 2050, the demand for energy will surge, intensifying the need for sustainable energy solutions. Alberta, renowned for its abundance of natural resources and commitment to driving technology and innovation, is at the epicentre of this evolution. The intersection of AI and energy presents an unprecedented opportunity to not only boost the provincial economy but also champion global initiatives toward a sustainable future. In partnership with Alberta Innovates, Plug and Play is launching an Innovation Challenge focused on AI in the energy sector. This challenge seeks to source top technology startups worldwide, inviting them to showcase their cutting-edge artificial intelligence solutions that are poised to address critical challenges in the energy sector.", "speakers": []}, {"category": "Entrepreneurship", "title": "Solving the Right Problems: Is Systems Thinking the Missing Link?", "description": "It can be tempting to rush toward rapid pathways to solutions like design sprints and slick pitches for new products or programs, but what happens when these solutions are misaligned with the actual problems they claim to solve? How do we even know if we are solving the right problem to begin with?  Join this discussion to learn how to overcome the solution bias by employing pre-innovation practices that focus on understanding issues and identifying positive change opportunities to identify solutions that match your true problem.", "speakers": [{"name": "Alicia Tropak", "position": "Director, Transformation at ATCO"}, {"name": "George Constantinescu", "position": "Executive Vice President and Chief Transformation Officer at ATCO"}, {"name": "James Stauch", "position": "Executive Director, Institute for Community Prosperity at MRU"}, {"name": "Alita Vaz", "position": "Platform Specialist, Information Design at ATCO"}]}, {"category": "Blurring Boundaries", "title": "Inventures Startup Pitch Competition", "description": "Watch as our five finalists pitch their product or service to our audience of venture capitalists, angel investors, entrepreneurs, early adopters, business educators and service providers. The winning company from each program track will be announced during the Inventures Closing Ceremony on May 31 and receive $10,000!", "speakers": [{"name": "Joelle Foster", "position": "President and CEO at North Forge Technology Exchange"}, {"name": "Brent Holliday", "position": "CEO at Garibaldi Capital Advisors"}, {"name": "John Albright", "position": "Founder & Partner at Relay Ventures"}, {"name": "Sheetal Walsh", "position": "Founder and CEO at U of A Innovation Fund"}]}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "Rethinking Approaches to Unlocking Health Data", "description": "The advancement of groundbreaking technologies in the healthcare sector relies heavily on access to high quality data, which is crucial for validating products in real-world settings. This reliance necessitates an evolution of our health data ecosystem to better meet the needs of patients and healthcare providers. As envisioned in the “Interoperability Saves Lives” Report, we can adopt a more holistic approach to patient information and data, moving beyond the confines of individual institutional responsibilities. Join this session to hear from experts on how we can transform the healthcare data landscape, ensuring that everyone benefits from advancements in health data management and technology.", "speakers": [{"name": "Ray Yue", "position": "Founder & CEO at Care Group"}, {"name": "Mark Korthuis", "position": "President & CEO at Glenrose Hospital Foundation"}, {"name": "Dr. Ewan Affleck", "position": "Senior Medical Advisor - Health Informatics at  Alberta's Virtual Care Coordinating Body"}, {"name": "Tim Murphy", "position": "VP, Health at Alberta Innovates"}]}, {"category": "Aspiring Entrepreneurs", "title": "Getting UNSTUCK with Heather Kernahan", "description": "This session features the author of the book UNSTUCKable and showcases the 10 Ways to Get AND Stay Unstuck. Her Founder Friday session in February was the highest rated session ever in the three year history of Founder Fridays. 100 copies of Heather's book UNSTUCKABLE will be given away after this session.", "speakers": [{"name": "Heather Kernahan", "position": "Global CEO at Hotwire Global"}, {"name": "Craig Elias", "position": "Entrepreneur-in-Residence at Bow Valley College"}]}, {"category": "Entrepreneurship", "title": "Unlock the Secrets to Entrepreneurial Success: A Deep Dive into Mentorship", "description": "Join us for an engaging session where seasoned entrepreneurs and industry leaders share invaluable insights on overcoming challenges in startups, mastering effective leadership strategies, and navigating future trends. Discover the power of mentorship in shaping your entrepreneurial journey and gain actionable tips to propel your venture to new heights.", "speakers": [{"name": "Darren Bondar", "position": "CEO at Hempalta Inc"}, {"name": "Adam Legge", "position": "President & CEO at Business Council of Alberta"}, {"name": "Melissa Smith", "position": "Partner at Borden Ladner Gervais LLP"}, {"name": "Paul Sullivan", "position": "Mentor, Board Chair at Venture Mentoring Service of Alberta"}]}, {"category": "Blurring Boundaries", "title": "Innovation and Inclusivity: Fostering a Diverse Environment in Tech", "description": "Join us for a session focused on blending technology and social innovation to empower adults on the autism spectrum, while also deconstructing ableism and fostering allyship in business. Gain actionable insights into creating inclusive environments and driving competitive advantage through diversity. Walk away ready to champion inclusivity in both professional and social spheres.", "speakers": [{"name": "Katie MacMillan", "position": "Executive Director at Kello Inclusive"}, {"name": "Ling Huang", "position": "CEO at Technology North Corporation"}, {"name": "Tonie Minhas", "position": "Project Manager, Neuroinclusion Services at Auticon Canada"}, {"name": "Andy Saldaña", "position": "Chief Operating Officer + Co-founder at QueerTech"}]}, {"category": "Earth Tech: Building Everything Better", "title": "Addressing the Storage Shortage: Innovative Storage Solutions for Reliable & Clean Energy Supply", "description": "As the demand for clean energy continues to rise, we need to find ways to store it to ensure a consistent and reliable clean energy supply. Our aim is to work together to achieve a sustainable future by overcoming the current challenges and limitations in energy storage. Join us to understand the critical needs driving this transformation, explore the innovative solutions available, and discover their practical implications. Let's work together to power up a sustainable future.", "speakers": [{"name": "Brandy Kinkead", "position": "CTO at Ayrton Energy"}, {"name": "Shantel Butler", "position": "Founder & CEO at Elektra Industries"}, {"name": "Himanshu Sudan", "position": "CEO at Jule - powered by Ecamion"}]}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "Women in Space: Pioneering Health and Science Beyond Earth", "description": "As humanity ventures further into the cosmos, the role of women in space exploration and health sciences has become increasingly vital. This timely panel brings together experts and visionaries to discuss the groundbreaking contributions of women in shaping our understanding of space and human health beyond our planet.", "speakers": [{"name": "Emma Louden", "position": "Astrophysicist at Yale University"}, {"name": "Fay Ghani", "position": "Medical Researcher at Mayo Clinic"}, {"name": "Tara Ruttley", "position": "Chief Scientist, Orbital Reef at Blue Origin"}]}, {"category": "Ancillary Pitch Programming", "title": "Resource Round Up: Empowering Entrepreneurs to Unlock Strategic Collaborations", "description": "Unlike traditional pitches where startups seek capital, in this unique interactive session presented by Red Deer Polytechnic, entrepreneurs will outline the specific support they need to propel their ventures forward and the audience will play a pivotal role in solving those challenges. Each entrepreneur will have three minutes to present their company and articulate the support they require. To foster collaboration, an online app will enable the audience to connect with entrepreneurs in real-time and will transform the Resource Round Up from a one-way presentation to a dynamic networking opportunity.", "speakers": [{"name": "Shelagh Hayes", "position": "Director General at PrairiesCan"}, {"name": "Matt Cornall", "position": "Technology Development Advisor at Alberta Innovates"}]}, {"category": "Blurring Boundaries", "title": "AI4Good: Social Innovation in Tech and Beyond", "description": "Join us as we explore the need for thoughtful design in social work, upskilling, inclusive design principles in gaming, and infusing social impact into our ventures. Attendees will gain actionable strategies for incorporating inclusive and socially responsible practices into their work.", "speakers": [{"name": "Ashif Mawji", "position": "Managing Director at ScaleGood Fund LP"}, {"name": "Rosalinda Hernandez", "position": "Co-Founder & CEO at Red Iron Labs"}, {"name": "Robert Price", "position": "Founder and Chief Executive Officer at Bōde"}, {"name": "David Ducasses", "position": "COO at Kaleidoscope XR"}]}, {"category": "Entrepreneurship", "title": "Master Mentor Program (Pre-Registration Required)", "description": "Designed to facilitate connections between expert advisors and the next generation of tech companies, the Master Mentors program runs May 29 and 30 during the Inventures conference. Registered Inventures attendees can tap into a network of advisors who are ready to guide you on your next business move or strategic connection.", "speakers": []}, {"category": "Earth Tech: Building Everything Better", "title": "Think Global, Act Local: Digital Solutions for a Water Secure Future", "description": "Around the world, safe, secure supplies of water are a basic and critical human necessity. However, solutions for addressing global water quality issues often differ across geographic regions and types of communities. Join this session to hear experts discuss business and technology pathways to deliver novel digital solutions that can decrease costs and GHG emissions while providing safe and secure water to urban, rural and remote communities around the world.", "speakers": [{"name": "Amirreza Sohrabi", "position": "Co-Founder & CEO at Roshan Water Solutions"}, {"name": "Dr. Kim Sturgess", "position": "Member of Order of Canada at Alberta Water Smart"}, {"name": "Martha White", "position": "CEO at RL Core Technologies"}, {"name": "Cam Cote", "position": "CEO at InteliRain"}]}, {"category": "Lethbridge College START Centre: VR Sessions", "title": "How Machines Can Empower Every Learner to Fulfill Their Human Potential", "description": "Through looking at case studies and research, we will examine how the reinvention of learning design through AI and XR can drive a more accessible, engaging, and impactful future for education.", "speakers": [{"name": "Chris Mallet", "position": "CEO at Bodyswaps"}]}, {"category": "Keynote", "title": "Book Signing: Heather Kernahan", "description": "Heather's book - UNSTUCKABLE - details how tech leaders have used innovation thinking to continuously keep moving forward and creating the future. If you are a business leader who has struggled with feeling stuck and wants to operate at the top level in your industry, this book is for you. \nJoin us for a book signing with Heather Kernahan, featuring his new book, “UNSTUCKABLE”.", "speakers": [{"name": "Heather Kernahan", "position": "Global CEO at Hotwire Global"}]}, {"category": "Shared Studios: INVENTURE$ Canada Portal", "title": "Tech Solutuions in Women's Healthcare", "description": "Step into our portal and meet innovators from around the globe. Engage in real-time conversations directly from Kigali, Rwanda, with Berabose Aline Joyce, CEO of Luna. Luna is a women’s health and fitness initiative that uses technology to deliver innovative solutions to women’s healthcare across the African continent.", "speakers": [{"name": "Berabose Aline Joyce", "position": "Founder & CEO at LUNA"}]}, {"category": "Lethbridge College START Centre: Spatial Tech Experimentation", "title": "Lethbridge College START Centre: Spatial Tech Experimentation", "description": "Step into our cutting-edge technology showcase room at INVENTURES and experience the future firsthand. Our room features the Varjo XR-4 headset, offering unmatched virtual and mixed reality with its high resolution and advanced eye-tracking. Feel the thrill of realistic driving with our motion driving simulator and explore the precision of our latest scanning technology. Get hands-on with the Alberta-made Peregrine Glove, a revolutionary input device transforming how we interact with digital environments. Discover the immense potential of these technologies and learn how the Spatial Technologies Applied Research and Training (START) Centre can help turn visionary possibilities into reality.", "speakers": []}, {"category": "Lethbridge College START Centre: Metaverse Mentoring", "title": "Lethbridge College START Centre: Metaverse Mentoring", "description": "Visit our Metaverse Mentoring room at INVENTURES, where attendees can immerse themselves in a variety of immersive prototype experiences. Engage with lead researchers and discover how immersive technologies can transform your organization. Whether you're curious about the latest advancements or seeking expert advice on your spatial technology ideas, our team is ready to guide you. Explore, learn, and unlock the potential of the spatial technologies for your business.", "speakers": []}, {"category": "Lethbridge College START Centre: VR Sessions", "title": "What the Ai Africa : From Farm to FORK", "description": "For the session, I will delve into the transformative impact of AI on agriculture, revolutionizing the entire food supply chain from farm to fork. Here are some key points I will cover: Precision Agriculture: AI enables farmers to optimize crop yields by analyzing data from sensors, drones, and satellites to make informed decisions about irrigation, fertilization, and pest control. Crop Monitoring and Management: AI-powered systems can monitor crop health in real-time, detecting diseases and nutrient deficiencies early, allowing for targeted interventions and reducing crop losses. Supply Chain Optimization: AI algorithms streamline the distribution process, predicting demand, optimizing logistics, and minimizing food waste from production to distribution. Smart Farming Solutions: AI-driven technologies such as autonomous tractors and robotic harvesters increase efficiency and reduce labor costs, transforming traditional farming practices. I'll also explore how AI is reshaping agriculture and food production, highlighting the opportunities and challenges it presents for farmers, businesses, and consumers alike.", "speakers": [{"name": "James Muindi", "position": "COO at Zynamis"}]}, {"category": "Tech Triathlon: Quantum + AI + IoT", "title": "Empowering the Future: Women Leading the Tech Revolution", "description": "Join trailblazing women at the forefront of the tech industry as they delve into the latest emerging trends, transformative technologies and advancements shaping our digital world. Gain valuable perspectives on career growth, the importance of mentorship and allies, and strategies for navigating a successful career in this rapidly changing industry. We warmly invite women and their allies to join this interactive dialogue that aims to inspire and empower attendees to harness their potential and play an active role in shaping the future of technology.", "speakers": [{"name": "Vandana Chauhan", "position": "Technology Manager at Skip the Dishes"}, {"name": "Christine Gillies", "position": "Chief Product and Marketing Officer at Blackline Safety"}, {"name": "Brenda Beckedorf", "position": "CEO at Society 5.0"}, {"name": "Catherine Berg", "position": "Director, Cloud and Technology Enablement at Slalom"}]}, {"category": "Ancillary Pitch Programming", "title": "UCalgary x TC Energy Ingenuity Pitch Prize", "description": "In partnership with TC Energy, the University of Calgary Hunter Hub for Entrepreneurial Thinking is proud to present the Ingenuity Pitch Prize. Featuring the top innovators from the University of Calgary, this pitch competition represents the culmination of the Ascent program. A co-curricular offering designed to provide funding and training for innovators to take their ideas from conception to commercialization. Witness the top teams pitch their ideas to a panel of judges for up to $50k in prizes.", "speakers": [{"name": "Ines Bartilotti", "position": "Director New Ventures at Innovate Calgary"}, {"name": "Colin Dalton", "position": "Associate Professor at University of Calgry"}, {"name": "Mike Procee", "position": "Manager, Project Enablement at TC Energy"}]}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "Empowering Health: Wearable Health Tech and Personalized Data Solutions", "description": "Experts will tackle the challenges of preventing opioid overdose, monitoring glucose and lactate levels in real time, and addressing privacy concerns in health data management. Through the integration of AI, wearable technology, and person-centered data systems, the session will explore innovative solutions to enhance health outcomes while providing individuals with greater agency over their personal health data. Attendees will gain insights into the future of personalized healthcare and how these advancements can lead to more effective prevention strategies and improved privacy protections.", "speakers": [{"name": "Simran Dhillon", "position": "CEO & Co-Founder at FentaGone"}, {"name": "Dr. Peter Light", "position": "CSO, Fringe Field Technologies at University of Alberta"}, {"name": "Ellie Gordon", "position": "Founder & Chief Executive Officer at Behaivior"}]}, {"category": "Entrepreneurship", "title": "Raising Capital: Stories and Strategies from Startup Founders", "description": "Join us for an engaging panel discussion featuring alumni from the Alberta Accelerator by 500 Global, as they delve into the world of fundraising. The panel will cover the challenges, triumphs, and pivotal moments encountered while raising capital for their startups, offering firsthand accounts of the fundraising process and practical advice for navigating the fundraising landscape.", "speakers": [{"name": "Shaheel Hooda", "position": "General Partner at Sprout Fund"}, {"name": "Al-Karim Khimji", "position": "Co-founder & CEO at Propra"}, {"name": "Louis Kolla", "position": "Co-founder & CEO at RUNNR"}]}, {"category": "Entrepreneurship", "title": "Overcoming the Scaleup Gap: A Framework for Impact", "description": "The scaleup gap is a critical challenge faced by innovation ecosystems around the world. Accelerators play an important role in addressing this challenge by implementing supports and services that help companies build, grow and scale. In this session, you’ll learn about an exciting new systems model for overcoming the scaleup gap, powered by a leading holistic impact strategy from the Alberta Innovates Impact Action Lab that designs and implements for results. Hear about successes and learnings in its real-world application to the Alberta Scaleup and Growth Accelerator Program and our provincial innovation ecosystem. Join us to find out how this model can be applied to scale companies and strengthen innovation systems internationally, resulting in positive economic and societal impacts for Alberta, Canada, and globally.", "speakers": [{"name": "Dr. Kathryn Graham", "position": "Executive Director, Impact Action Lab  at Alberta Innovates"}, {"name": "Reesa John", "position": "Director, Fund & Fellowship at Alberta Innovates"}, {"name": "Jonathan Grant", "position": "CFO at Different Angles Ltd."}]}, {"category": "Growing Up: Food Tech Farm to Fork", "title": "Breakthrough Innovations in Climate and AgTech: Investor & Founder Perspectives", "description": "Climate change, global warming, and land degradation pose serious challenges to food security and agriculture. Currently, 30% of food is wasted, 33% of the world's soil is degraded, and climate change is affecting planetary health and ecosystem stability. This has a direct impact on the ability to grow food, access safe housing, and work. Industry experts are at the forefront of innovation, working towards solving this massive global problem. Join us to hear from them as they share their views on how to tackle this challenge head-on.", "speakers": [{"name": "Genevieve Pinto", "position": "Partner at Renewal Funds"}, {"name": "Angela Kouris", "position": "Co-Founder at Synergia Biotech"}, {"name": "Yuan Shi", "position": "General Partner at The51 Food and AgTech Fund"}, {"name": "Nuha Siddiqui", "position": "CEO & Co-Founder at Erthos Inc."}]}, {"category": "Entrepreneurship", "title": "Innovative Solutions to the Skills Gap", "description": "Skilled workers are critical to addressing current and emerging challenges for the Canadian and global economy. However, Alberta is facing a skills shortage and will need to replace a quarter of its workforce within the next decade. With the rapid pace of technological change, and continually shifting market and regulatory demands, todays skilled workers and their employers are engaged in an ever increasingly complex work environment.  Join this session to hear about the specific challenge faced by organizations and educational institutes as they address how they will approach this grand challenge and learn about some of the exciting initiatives they are undertaking.", "speakers": [{"name": "Laura Jo Gunter", "position": "President & CEO at NAIT"}, {"name": "Evan Legate", "position": "Executive Director at Resource Diversification Council"}, {"name": "Lorraine Royer", "position": "General Manager at Sustainability, Government & Indigenous Relations for Inter Pipeline (IPL)"}]}, {"category": "Blurring Boundaries", "title": "Diverse Talent Dynamics: AI Solutions for Inclusive Workplaces", "description": "Through collaborative discussions and insights from experts in talent management and AI integration, attendees will gain actionable strategies for creating inclusive environments that attract and retain diverse talent, driving innovation and success in the workplace.  Walk away empowered to create an inclusive workplace that not only thrives in the future of work but leads the way in driving lasting success.", "speakers": [{"name": "Rotimi Ojo", "position": "Diversity Recruitment Thought Leader & Founder of Unleash Awareness at Unleash Awareness"}, {"name": "Marci Laurence", "position": "Head of People and Culture at Virtual Gurus"}, {"name": "Naoufel Testaouni", "position": "CEO & Co-Founder at QueerTech"}]}, {"category": "Aspiring Entrepreneurs", "title": "Student Pitch Competition Preliminary Round #2", "description": "The student pitch competition helps promising student entrepreneurs and recent alumni from post-secondary institutions across Canada gain the exposure, feedback, and resources that their business idea needs to succeed.During the preliminary rounds of the student pitch competition, six contestants are given four minutes each to dazzle a live audience and a panel of judges with their ideas, innovations, products, and/or services.At the end of the second day, the six finalists from the two preliminary rounds will pitch to early-stage investors from the United States and Canada.The top three will be announced during the closing ceremonies on Friday afternoon.", "speakers": [{"name": "Craig Elias", "position": "Entrepreneur-in-Residence at Bow Valley College"}, {"name": "Mike Hrabowiecky", "position": "Specialist at Enbridge Inc."}, {"name": "Tina Mathas", "position": "CTO at General Bank of Canada"}, {"name": "Stephan Zuberec", "position": "Technology Development Advisor at Alberta Innovates"}, {"name": "Katherine Farthing", "position": "Employment Success Manager at Palette Skills"}]}, {"category": "Entrepreneurship", "title": "Intellectual Horizons: Crafting Global IP Strategies for Quantum, Cleantech, and AI Scaleups", "description": "When scaling globally, it is important to have a strong IP strategy.  Join industry experts in a focused discussion on current IP trends, jurisdictional considerations, and emerging technology implications. Gain practical insights to strengthen your company’s intellectual assets and excel on a global stage.", "speakers": [{"name": "Kevin Dahl", "position": "Director at ElevateIP Alberta"}, {"name": "Lisa Desjardins", "position": "Manager, Business Services Design and Development at Canadian Intellectual Property Office"}, {"name": "Erin Pisko", "position": "Vice President, IP Strategy at Innovation Asset Collective"}]}, {"category": "Earth Tech: Building Everything Better", "title": "The Comeback Kid: Nuclear Technology in a Dynamic Global Economy", "description": "Nuclear technology is increasingly being recognized for its strong potential to help meet the growing global need for net-zero electricity. Beyond power generation, it also provides opportunities across heat, medicine, long-distance transport, and hydrogen production applications. Despite the renewed promise of this technology, it continues to face considerable public acceptance challenges, it requires new policies and regulations to better enable its development and demands significant capital investment to scale. In this session, we’ll explore the opportunities and challenges that nuclear technology faces locally, nationally and internationally, and the benefits it can provide in today’s low carbon economy.", "speakers": [{"name": "Rose Robinson", "position": "Director  at NBPower, Advanced Reactor Development"}, {"name": "Nikki Walton", "position": "Manager, Nuclear Strategic Initiatives at McMaster University"}, {"name": "Andrew Thiele", "position": "Executive Director at Canadian Nuclear Isotope Council"}, {"name": "Bruce Duong", "position": "Senior Manager, Recovery Technologies at Alberta Innovates"}]}, {"category": "Earth Tech: Building Everything Better", "title": "Scaling Climate Tech for Global Impact: Lessons Learned from Investors & Founders", "description": "Climate change is a global crisis that demands innovative solutions. In Alberta, a province known for its energy resources, a new wave of investors, entrepreneurs and startups is emerging, dedicated to addressing climate challenges through technology and innovation. Join this session to delve into hurdles that investors and founders in the Climate Tech space encounter, from securing funding, to hiring, and navigating international markets and regulations.", "speakers": [{"name": "Jotham Chow", "position": "Senior Analyst at Amplify Capital"}, {"name": "Myra Ashrad", "position": "Co-Founder &. CEO at Alt Tex"}, {"name": "Madison Savilow", "position": "Director of Corporate and External Affairs at Carbon Upcycling Technologies"}, {"name": "Matthew Alexander", "position": "VP of Finance at Future Fields"}]}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "Announcement: IDEATE Launch", "description": "Join Alberta Innovates’ Health Platforms Team as they announce the start of a unique $4 million program to assist Health Tech Innovators.  NOTE: Seating is limited", "speakers": []}, {"category": "Lunch & Networking", "title": "Networking Lunch", "description": "An elevated bento box lunch will be available for pick up in Hall E and the Macleod Foyer area. Grab your lunch and take a stroll around the conference centre to experience all the exhibitors and experiential elements throughout.", "speakers": []}, {"category": "Shared Studios: INVENTURE$ Canada Portal", "title": "The future is Highdigenous!", "description": "Step into our portal and meet innovators from around the globe. Engage in real-time conversations with innovators from Kabakoo Academies, based in Bamako Mali, to learn how they are merging high-tech and Indigenous knowledge to decolonize minds and solve real-life challenges.", "speakers": []}, {"category": "Keynote", "title": "When Humanity & Technology Collide: Reimagining Creativity Through AI", "description": "When innovative companies like Google, 3M, Cisco, Pepsi, Rogers, and SAP want to spark creativity in their employees and executives, they bring in David Usher. He doesn’t just talk creativity and artificial intelligence (AI) – he lives it. Usher draws from his unique experience as the lead singer of Moist; a multi-platinum, four-time Juno award-winning musician; a bestselling author; and as the founder of the artificial intelligence creative studio, Reimagine AI, to help organizations reboot their creativity in this brave new world of disruptive change. Join this compelling keynote to hear David share his experience living and working where humanity and technology collide.", "speakers": [{"name": "David Usher", "position": "Juno Award-Winning Musician | Creativity & AI Expert"}, {"name": "Darrell Brertton", "position": "Saddle Lake Cree Nation"}]}, {"category": "Networking", "title": "Networking Break", "description": "Refreshments will be available in all pre-function areas of the conference centre throughout the event, including during networking breaks.   Grab a drink and a snack in the Exhibition Hall Foyer, Macleod Foyer, Telus Foyer, or Glen Foyer. This is a great opportunity to visit the exhibitors and experiential elements of Inventures.", "speakers": []}, {"category": "Keynote", "title": "Meet and Greet: David Usher", "description": "Following David Usher’s compelling keynote talk, he’ll be available for a meet and greet! Don’t miss your opportunity to shake hands and grab a photo with a multi-platinum, four-time Juno award-winning musician; a bestselling author; and the founder of the artificial intelligence creative studio, Reimagine AI.", "speakers": [{"name": "David Usher", "position": "Juno Award-Winning Musician | Creativity & AI Expert"}]}, {"category": "Blurring Boundaries", "title": "Innovate & Elevate: Mastering Conference Impact", "description": "Unlock the secrets of Canadian thought leaders who wield conferences as catalysts for global recognition. Dive into their strategies for showcasing groundbreaking work, amplifying Canada’s innovative edge, and competing internationally. Be part of the innovation wave—join us!", "speakers": [{"name": "Sheldon Williamson", "position": "Professor and Canada Research Chair at Ontario Tech University"}, {"name": "Fraser Abbott", "position": "Director, Calgary Champions Program at Tourism Calgary"}]}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "Powered by Partnership: Environmental Sustainability in Indigenous Communities", "description": "Métis and First Nations communities in Alberta and northeastern BC are partnering with NAIT to tackle environmental challenges affecting land and freshwater due to climate change and industrial activities. This session highlights how these collaborations blend NAIT's applied research expertise in Western science with the traditional knowledge of these communities to address challenges they identify. Through joint efforts, the team creates lab and field-based training that empowers Indigenous communities to develop and pursue applied research questions crucial to them, delivering immediate and community-wide benefits.", "speakers": [{"name": "Carol Wildcat", "position": "Director Industrial Relations at Ermineskin Cree Nation"}, {"name": "Dr. Kevin Kemball", "position": "Business Development Lead, Forestry & Environmental Sustainability, Applied Research at NAIT"}, {"name": "Lynn Smith", "position": "Regional Planning Coordinator at Peavine Metís Settlement"}]}, {"category": "Tech Triathlon: Quantum + AI + IoT", "title": "Cybersecurity: Are you Prepared for a Cyber-Attack?", "description": "The threat of cyber-attacks looms large over individuals, businesses, and governments, driven by the growing sophistication of cybercriminals and the ever-changing landscape of technology. Delve into the forefront of cybersecurity technology, including AI, blockchain, and quantum encryption, to unearth their far-reaching ramifications. Join this session to discover strategies for assessing your current cybersecurity posture and effectively preparing for, mitigating, and responding to cyber-attacks.", "speakers": [{"name": "Scott McPhee", "position": "Chief Security Architect at ENFOCOM International Corporation"}, {"name": "Cara Wolfe", "position": "CEO at Ammolite Analytx"}, {"name": "Deryck Greer", "position": "Chief Information Security Officer at Protexxa"}]}, {"category": "Growing Up: Food Tech Farm to Fork", "title": "New Proteins for New Products", "description": "The global demand for protein production is projected to soar by 2050. While animal-based meat has long been the mainstay, there's a surging interest in alternative protein sources. This presents a thrilling opportunity for the food industry to adapt to changing consumer preferences. Plant-based alternatives have already found their way onto our plates, but what about adding a serving of cellular agriculture or perhaps a dish of 3D-printed food? While traditional meat substitutes have their place, is it feasible to explore less conventional options for our meals? Can these alternatives truly address the global dietary demands of tomorrow? This panel delves into the mushrooming trends across various protein types, encompassing both traditional and unconventional alternatives. The panelists will navigate the dynamic landscape of protein sources and their implications for the future of food production, even when they appear at odds with tradition. Join us as we uncover the potential of these new proteins to become new products that would reshape our food perception while meeting the ever-evolving needs of consumers worldwide.", "speakers": [{"name": "Jonathan Blutinger", "position": "Food Engineer at U.S. Army DEVCOM Soldier Center, Combat Feeding Division"}, {"name": "Dr. Steven Webb", "position": "Chief Executive Officer at Global Institute for Food Security"}, {"name": "Isha Datar", "position": "Executive Director at New Harvest"}, {"name": "William Greuel", "position": "Chief Executive Officer at Protein Industries Canada"}]}, {"category": "Shared Studios: INVENTURE$ Canada Portal", "title": "Training the Next Tech Workforce", "description": "Step into our portal and meet innovators from around the globe. Engage in real-time conversations with young entrepreneurs from Makers Valley who are using digital technologies to create an equitable workforce for the growing neighbourhood of Victoria Yards in Johannesburg.", "speakers": []}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "Neurovation: Investing in the Future of NeuroTech", "description": "Dive into the forefront of neuroscience innovation at this panel session hosted by the Hotchkiss Brain Institute. Explore the cutting-edge advancements shaping tomorrow’s neurotech landscape and learn how to harness their potential for transformative impact. Seize the opportunity to invest, collaborate, and drive forward the future of neuroscience.", "speakers": [{"name": "Dr. Lawrence Korngut", "position": "Director of Innovation & Commercialization at Hotchkiss Brain Institute"}, {"name": "Dr. Dion Kelly", "position": "Co-Founder & CEO at Possibility Neurotechnologies | Clinical Neuroscientist at BCI4Kids at Possibility Neurotechnologies"}, {"name": "Dr. Neil Duggal", "position": "Neurosurgeon at London Health Sciences"}, {"name": "Mike Duong", "position": "Head of Innovation at Hoffmann-La Roche Ltd."}]}, {"category": "Entrepreneurship", "title": "International Outlooks: Connecting Canadian Companies with International Investors", "description": "Canada is flush with exciting and innovative start up technologies and businesses. Attracting foreign investment represents an important opportunity to advance Canadian innovation and grow the local and global economy. Join this important discussion to learn about the opportunities and challenges of raising capital from abroad. Hear from international investors about what they are seeking in an investment opportunity, and from Canadian companies who have successfully tapped into international capital markets.", "speakers": [{"name": "Shay Natarajan", "position": "Partner - Strategy at Mobility Impact Partners"}, {"name": "Allen Chong", "position": "Senior Advisor Investor Relations at Global Affairs Canada"}, {"name": "Ghada Nafie", "position": "CEO & Co-Founder at Litus"}]}, {"category": "Entrepreneurship", "title": "Investing for Life: The Role of Venture Capital in Delivering Positive Patient Outcomes", "description": "Join this panel of experts to learn about the role of venture capital in advancing innovative solutions, technologies and companies in life sciences. Learn how these investments are improving lives and enhancing patient care while generating returns.", "speakers": [{"name": "Doug Holt", "position": "Associate Vice President, Capital Development at Alberta Innovates"}, {"name": "Derrick Mayes", "position": "Co-Founder and Senior Advisor at BVE"}, {"name": "Ross O'Brien", "position": "Bonaventure Equity, LLC at Founder & Managing Partner"}]}, {"category": "Entrepreneurship", "title": "Acceleration Innovation: Scaling Strategies for the Digital Era", "description": "Explore the boundless opportunities to innovate and scale up in today's digital age at our session on scaling strategies and covering corporate ecosystems. Leave inspired and empowered to navigate the dynamic digital landscape with confidence.", "speakers": [{"name": "Dan Burgar", "position": "CEO at Frontier Collective"}, {"name": "Dr. Alex Bruton", "position": "Founder at Moonshot OS"}, {"name": "Brett Colvin", "position": "CEO & Co-founder at GoodLawyer"}, {"name": "Kira Kelsie", "position": "CEO at Kasm Consulting"}]}, {"category": "Entrepreneurship", "title": "Inventures Startup Pitch Competition", "description": "Watch as our five finalists pitch their product or service to our audience of venture capitalists, angel investors, entrepreneurs, early adopters, business educators and service providers. The winning company from each program track will be announced during the Inventures Closing Ceremony on May 31 and receive $10,000!", "speakers": [{"name": "Brent Holliday", "position": "CEO at Garibaldi Capital Advisors"}, {"name": "Leana Keto", "position": "Associate Principal at BDC Industrial Innovation Fund"}, {"name": "Amy Peck", "position": "CEO at EndeavorXR"}, {"name": "Judy Fairburn", "position": "Fund Managing Partner at The51 Ventures Inc."}]}, {"category": "Ancillary Pitch Programming", "title": "Resource Round Up: Empowering Entrepreneurs to Unlock Strategic Collaborations  Pt. 2", "description": "Unlike traditional pitches where startups seek capital, in this unique interactive session presented by Red Deer Polytechnic, entrepreneurs will outline the specific support they need to propel their ventures forward and the audience will play a pivotal role in solving those challenges. Each entrepreneur will have three minutes to present their company and articulate the support they require. To foster collaboration, an online app will enable the audience to connect with entrepreneurs in real-time and will transform the Resource Round Up from a one-way presentation to a dynamic networking opportunity.", "speakers": [{"name": "Ken Doyle", "position": "Executive Director at Tech-Access Canada"}, {"name": "Alicia Cafferata-Arnett", "position": "Applied Research Specialist at Red Deer Polytechnic"}]}, {"category": "Tech Triathlon: Quantum + AI + IoT", "title": "AI in Education: Bridging Theory, Application and Stakeholder Concerns", "description": "Join us for an exploration into the dynamic world of AI integration in education. From theory to practical application, we'll explore how to harness the power of AI while addressing the genuine concerns of parents and educators. Walk away with actionable insights on fostering a collaborative approach to seamlessly integrate AI into the classroom, ensuring a transformative and inclusive learning experience for all.", "speakers": [{"name": "Dr. Sidney Shapiro", "position": "Assistant Professor, Business Analytics at University of Lethbridge's Dhillon School of Business"}, {"name": "Jenna Galloway", "position": "Founder & CEO at Fledge"}, {"name": "Jillian Kowalchuk", "position": "K-12 Education Advisor at Alberta Machine Intelligence Institute (Amii)"}]}, {"category": "Growing Up: Food Tech Farm to Fork", "title": "Farming Futures: New Innovations to Feed a Growing Global Population", "description": "By 2050, food production must increase by as much as 68 percent to feed the growing global population. Now, let’s fast-forward to that very year—2050—where we have witnessed remarkable advancements in technology and practices, such as robotics, agrivoltaics, efficient soil inputs, digital food safety, and food traceability. In this session, we will embark into the cutting-edge agricultural technologies that are revolutionizing the industry. Our focus? Not just the present, but also the tantalizing glimpse of what these innovations might evolve into by 2050. Brace yourselves for a journey where science fiction meets the agri-food sector!", "speakers": [{"name": "Jon Bichel", "position": "COO at Solartility"}, {"name": "Kiju Lee", "position": "Associate Professor at Texas A&M University"}, {"name": "Matt Labine", "position": "Agri-Food Business Development Lead at NAIT"}, {"name": "Erik Westblom", "position": "Founder & CEO at Provision Analytics"}, {"name": "Sumit Verma", "position": "Reazent at Co-Founder & CEO"}]}, {"category": "Earth Tech: Building Everything Better", "title": "From Garbage to Gold: Transformation of Waste into Resources", "description": "We’ve all heard the expression ‘one person’s trash is another’s treasure’. In today’s economy, this is increasingly true. Across sectors and industries, significant opportunities exist to divert waste from landfills and convert it into value-add inputs and products, resulting in fewer emissions, increased efficiency, and contributing to a more circular economy. In this session, we’ll hear from experts on the opportunities and challenges of scaling up technologies and implementing the business practices that can turn our garbage into gold.", "speakers": [{"name": "Bram van den Berg", "position": "COO at Circular Rubber Technologies Inc."}, {"name": "Hari Balasubramanian", "position": "Founding Managing Partner at EcoAdvisors Incorporated"}, {"name": "Chris Perry", "position": "CEO and Co-Chair at Perry Family Farm and the Canadian Biogas Association"}, {"name": "Mehr Nikoo", "position": "Senior Manager Sustainable Materials at Alberta Innovates"}, {"name": "Vittoria Bellissimo", "position": "President & CEO at Canadian Renewable Energy Association"}]}, {"category": "Earth Tech: Building Everything Better", "title": "Bitumen Beyond Combustion: Re-imagining the Oil and Gas Industry", "description": "As energy systems transition towards net zero, there is an opportunity to re-imagine the oil and gas industry as a manufacturing and products industry. Bitumen derived products from oil and gas have significant potential for creating new materials, including carbon fibre, high-quality asphalt, carbon nanotubes, graphene, battery materials, and more. These advanced materials have applications in numerous and diverse sectors, from automotive to building materials, and represent opportunities for new industries in western Canada and beyond. Join this session to explore the most compelling opportunities for Bitumen Beyond Combustion, the opportunities for investment, and how we can advance this innovative technology opportunity.", "speakers": [{"name": "Dr. Zhihong (John) Zhou", "position": "Chief Cleantech Officer and VP Clean Resources at Alberta Innovates"}, {"name": "Arlene Ai", "position": "CEO and Co-founder at Momentum Materials Solutions Corp."}, {"name": "Jozef Roosen", "position": "CCO at AdVen"}, {"name": "Larry Young", "position": "President & CEO at Total Containment Inc"}]}, {"category": "Ancillary Pitch Programming", "title": "SVG Ventures | THRIVE & Alberta Innovates Present The Climate Challenge Pitch Showcase", "description": "Join us Thursday in the Imperial Ballroom of the Hyatt from 2:45-4:15pm for an exhilarating showcase of innovation at the Climate Challenge Pitch Showcase! Witness ten global finalists as they unveil ground-breaking solutions at the intersection of agriculture and energy. Featuring solutions on advancing the biofuel value chain, on-farm energy and water stewardship, these visionary entrepreneurs are redefining our approach to climate resilience. Be inspired, connect with industry leaders, and play a part in shaping a sustainable future for generations to come. Don't miss this pivotal event where bold ideas meet real-world impact. See you there!", "speakers": [{"name": "Dana Gibson", "position": "Executive Director at Smart Agriculture and Food, Alberta Innovates"}, {"name": "Clark Dever", "position": "Accelerator Program Director at ThinkOnward.com"}, {"name": "John Cassidy", "position": "Managing Director I Canada at SVG Ventures THRIVE"}, {"name": "Darrell Petras", "position": "CEO at Canadian Agri-Food Automation and Intelligence Network"}, {"name": "Megan Croft Shapka", "position": "Ecosystem and Partnership Operations Manager at SVG Ventures THRIVE"}]}, {"category": "Aspiring Entrepreneurs", "title": "Bobbie Racette: Getting Unstuck Panel", "description": "Moderated by the multi-award winning entrepreneur Bobbi Racette, this panel features four highly inspiring people sharing their before and after stories of how they got unstuck personally and their successes once they got unstuck.", "speakers": [{"name": "Bobbie Racette", "position": "Founder & CEO at Virtual Gurus"}, {"name": "Charles Buchanan", "position": "CEO at Technology Helps"}, {"name": "Matthew Lowe", "position": "Co-founder & CEO at ZeroKey"}, {"name": "Jolene Livingston", "position": "Founder & Principal, Bespoke Social Profit Solutions Founder & CEO, Partners for Affordable Housing"}, {"name": "Alisha Olandesca", "position": "Co-Founder at Simpl.AR"}]}, {"category": "Lethbridge College START Centre: VR Sessions", "title": "Using VR to Level-Up Workplace Training", "description": "In this session, we will explore ways our customers implement VR to enhance employee training. Through real-life case studies, you will learn about five keyways VR can level up your current training offering without having to discard what you're already doing.", "speakers": [{"name": "Sara Johnston", "position": "COO at Motive.io"}]}, {"category": "Networking", "title": "Networking Break", "description": "Refreshments will be available in all pre-function areas of the conference centre throughout the event, including during networking breaks.   Grab a drink and a snack in the Exhibition Hall Foyer, Macleod Foyer, Telus Foyer, or Glen Foyer. This is a great opportunity to visit the exhibitors and experiential elements of Inventures.", "speakers": []}, {"category": "Aspiring Entrepreneurs", "title": "Student Pitch Competition Finals", "description": "The student pitch competition helps promising student entrepreneurs and recent alumni from post-secondary institutions across Canada gain the exposure, feedback, and resources that their business idea needs to succeed.During the final round of the student pitch competition, six contestants are given four minutes each to dazzle a live audience and a panel of judges with their ideas, innovations, products, and/or services.The six finalists from the two preliminary rounds will pitch to early-stage investors from the United States and Canada.The top three will be announced during the closing ceremonies on Friday afternoon.\"", "speakers": [{"name": "Craig Elias", "position": "Entrepreneur-in-Residence at Bow Valley College"}, {"name": "Dania Moazzam", "position": "VP Banking at RBCx"}, {"name": "John Albright", "position": "Founder & Partner at Relay Ventures"}, {"name": "Manpreet Deol", "position": "Venture Investor at Inovia"}, {"name": "Saif Hashmi", "position": "Principal at  BDC Seed Venture Fund"}]}, {"category": "Blurring Boundaries", "title": "Building a Human Tech Workforce", "description": "In a world where technology and human skills intersect, this roundtable discussion aims to chart a course for developing a workforce that is technologically adept while retaining indispensable human qualities. Participants will delve into strategies for harmonizing AI with empathy, creativity, and adaptability, fostering an inclusive workplace culture, and the significance of diversity in spurring innovation. Designed for business leaders, HR professionals, and tech industry stakeholders, this forward-thinking session will offer insights into upskilling employees, preparing for future tech advancements, and nurturing a workforce that is not just technically proficient, but also rich in emotional intelligence and humancentric skills.", "speakers": [{"name": "April Hicke", "position": "Co-Founder + Chief Growth Officer at Toast"}, {"name": "Kat Connolly", "position": "Intermediate Developer and Tech Educator at Checkfront"}, {"name": "Josh Rainbow", "position": "Data Consultant at Stealth"}, {"name": "Renee Matsalla", "position": "Co-Founder at Tacit Edge Product Leadership"}]}, {"category": "Entrepreneurship", "title": "Public Pathways: Financing Early-Stage Tech By Going Public", "description": "Canada is unique in its opportunity for early-stage growth companies to access regulated public markets. Alternative methods of going public and raising capital, including the capital pool company program, provide an avenue to access public capital to grow and scale your business.  Join us to learn from experts about going public, assessing readiness, and unlocking financing opportunities.", "speakers": [{"name": "Tim Babcock", "position": "VP & Head at TSX Venture Exchange"}, {"name": "Denise Weeres", "position": "Director, Corporate Finance at Alberta Securities Commission"}, {"name": "Cody Slater", "position": "CEO at Blackline Safety Corp."}, {"name": "Jessica Brown", "position": "Partner at Cassels LLP"}]}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "User-Centered Healthcare: Designing for People, Economics & Providers", "description": "Through discussions on the importance of involving physicians and healthcare providers in designing the healthcare ecosystem, we'll explore strategies to solve these challenges and achieve a more user-centric approach to healthcare innovation. Attendees will gain insights into how aligning economic considerations with the needs of end-users can lead to more effective and sustainable healthcare solutions.", "speakers": [{"name": "Catherine Laing", "position": "Executive Director at The Centre for Learning Innovation and Quality"}, {"name": "Dr. Jodi Abbott", "position": "President & CEO at University Hospital Foundation (UHF)"}, {"name": "Luke Sheen", "position": "Executive Director at HaloHealth"}, {"name": "Shaneel Pathak", "position": "CEO and Co-Founder at Zamplo"}]}, {"category": "Tech Triathlon: Quantum + AI + IoT", "title": "Navigating the AI Regulatory Landscape: Legal, Ethical and Fintech Perspectives", "description": "What are the current challenges of evolving the legal frameworks to keep up with rapidly advancing technology and AI, particularly in FinTech? Through collaborative discussions and insights from the ethical, legal, and regulatory dimensions to develop strategies for responsible AI innovation.", "speakers": [{"name": "Sepehr Shoarinejad", "position": "President at WalliHR"}, {"name": "Majid Charania", "position": "Director of Compliance at  Competition Bureau of Canada"}, {"name": "Mohamed Zohiri", "position": "Legal Counsel & FinTech Adivsor at Alberta Securities Commission"}, {"name": "Jo-Anne Yau", "position": "Innovations Lawyer at Miles Davison LLP"}]}, {"category": "Shared Studios: INVENTURE$ Canada Portal", "title": "Connecting Women Entrepreneurs in Tech", "description": "Step into our portal and meet innovators from around the globe. Engage in a real-time conversation with Marcella Gutierrez, the CEO and Founder of Lamarch, based in Mexico City. Learn about how she connects female entrepreneurs worldwide, building a strong digital network for the next generation of female leaders across tech industries.", "speakers": [{"name": "Marcela Gutierrez", "position": "CEO & Founder at Lamarch"}]}, {"category": "Earth Tech: Building Everything Better", "title": "Methane: The Other Greenhouse Gas", "description": "Methane is a potent greenhouse gas. It is also the main component in natural gas, which is used by over 25 million Canadians and accounts for nearly 40% of Canadian energy use. Canada was one of the first countries in the world to regulate methane emissions, and in 2021 became the first country to commit to reducing methane emissions from the oil and gas sector by at least 75%. This represents an enormous challenge for the natural gas industry, as it must rapidly accelerate the development, deployment, and scaling of existing and next-generation technologies. Join this session to gain insights into how industry, academia and government are collaborating to achieve this ambitious target.", "speakers": [{"name": "Akhil Abat", "position": "Board Member & Venture Partner at Kinitics Automation, NGIF Capital"}, {"name": "Dr. Ghazal Hajisalem", "position": "Senior Photonics Engineer at GeoTeknica Climate Change Solutions Inc."}, {"name": "Alastair MacFadden", "position": "Acting Assistant Deputy Minister, Alberta Region at PrairiesCan"}, {"name": "Scott Volk", "position": "Director of Emissions & Innovation at Tourmaline Oil Corp"}]}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "One Health, One Future: Innovating Across a Spectrum of Life", "description": "Embark on a 'One Health' exploration with us, as we examine the convergence of human, animal, and environmental health from innovative angles. Leading voices in agribusiness, infectious disease control, and traditional environmental stewardship will discuss challenges and opportunities for advancing more integrated and sustainable ventures.", "speakers": [{"name": "Dr. Herman Barkema", "position": "Professor at One Health at UCalgary"}, {"name": "Emily Herdman", "position": "Acting Director, Environmental Services at InnoTech Alberta"}, {"name": "Dr. Sunil Rajput", "position": "Director (Research), Health Innovation at Alberta Innovates"}]}, {"category": "Blurring Boundaries", "title": "Empowering Minds: Nurturing Mental Health in Entrepreneurial Leadership", "description": "Entrepreneurs are at a high risk of burnout, and other mental health risks. Join us for an inspiring session where we'll dive into the intersection of mental health and entrepreneurship, offering radical empathetic leadership strategies and insights into brain chemistry for founders. Discover actionable approaches to nurture a supportive culture, navigate challenges, and prioritize mental well-being in entrepreneurial ventures. Walk away with practical tools and a renewed perspective to lead authentically, thrive in business, and champion mental health in the entrepreneurial landscape.", "speakers": [{"name": "Anthea Sargeaunt", "position": "CEO at 2S Water"}, {"name": "Anand Ashok Bansode", "position": "Founder & CEO  at 360 Explorer Inc. (Transformational Travel)"}, {"name": "Jade Alberts", "position": "Founder at Peer Guidance"}, {"name": "Jayson Krause", "position": "Founder and Managing Director at Level 52 Inc."}]}, {"category": "Blurring Boundaries", "title": "AI at the City's Edge", "description": "Join us for an illuminating discussion on the symbiotic relationship between AI and Urbanization. Our expert panelists will explore real-world examples of AI implementation in city planning, from optimizing traffic flow to enhancing public spaces. Discover how AI can revolutionize urban development, making our cities smarter, more efficient, and better equipped to serve their diverse communities.", "speakers": [{"name": "Brittany Lee", "position": "Founder at Urban Techies"}, {"name": "Dustin Couzens", "position": "MRAIC, Co-founder at Architect, AAA"}]}, {"category": "Earth Tech: Building Everything Better", "title": "Remediation & Innovation: Creating a Clean and Prosperous Economy For All", "description": "Clean soil and water are fundamental to growing our economy and ensuring a prosperous, healthy and equitable society. Sustainable and socially responsible resource, waste and remediation management are critical to success, and much can be learned from innovative approaches, including environmental conservation, circular business practices, and Indigenous Ways of Knowing. Join this session to learn about practices that can help ensure we are not just doing less environmental harm; we are also creating net positive outcomes for the economy, society, and the planet.", "speakers": [{"name": "Dr. Curtis Purrington", "position": "COO at Austere Environmental"}, {"name": "Bita Malekian", "position": "Engineer at Water Movement"}, {"name": "Dr. Carol-Ann Brown", "position": "President at Delphi"}, {"name": "Patrick Troy", "position": "Chief Growth Officer at XRI Water"}]}, {"category": "Blurring Boundaries", "title": "Four Generations of Farming, Food & Family: Dame Sheila Barry Driscoll on Innovation, Legacy, and Le", "description": "In this not-to-be-missed fireside chat, Alberta Innovates’ own Laura Kilcrease sits down with Dame Sheila Barry Driscoll, a fourth-generation member of the Driscoll family and great-granddaughter of Jeremiah Driscoll, the founder of Driscoll’s berries. As the CEO of Dame Venturus, Dame Sheila epitomizes innovation and philanthropy, crafting legacies that transcend generations. With a career spanning the realms of media, agriculture, education, and philanthropy, Dame Sheila’s acumen for intellectual property and capital ventures has left indelible marks across pioneering female-led entrepreneurship, advanced cutting-edge food security technologies to championing women in STEM. Join us to hear Dame Sheila’s compelling story and how she is shaping a future of leadership, groundbreaking advancements, and compassionate innovation on both a local and global scale.", "speakers": [{"name": "Laura Kilcrease", "position": "Chief Executive Officer at Alberta Innovates"}, {"name": "Dame Sheila B.  Driscoll", "position": "CEO at Dame Venturus"}]}, {"category": "Earth Tech: Building Everything Better", "title": "Canadian Cleantech Goes Global: A Fireside Chat Series with Global Cleantech 100 Honorees", "description": "Now in its 15th year, the Global Cleantech 100 serves as a showcase of companies making significant contributions to sustainable innovation and as an annual barometer on the state of global cleantech. These innovators are at the forefront of addressing today’s most pressing climate and environmental challenges. Join this session to engage with Canadian companies who were named to this year’s list, as they share their perspectives on barriers and challenges to scaling their businesses and technologies, and the outlook for cleantech in Canada and globally.", "speakers": [{"name": "Dr. Saad Dara", "position": "President & Founder at Mangrove Lithium"}, {"name": "Austin  Pringle", "position": "Associate, Corporate Strategy at Summit Nanotech"}, {"name": "Todd Allmendinger", "position": "Cleantech Group at Director of Consulting and Research"}, {"name": "Jeanine Vany", "position": "Executive Vice President, Corporate Affairs at Eavor"}]}, {"category": "Lethbridge College START Centre: VR Sessions", "title": "Language Immersion: A Fundamentally Different Path to Conversational Fluency", "description": "In this talk Christian Rowe, Chief Growth Officer at Immerse, will share how language immersion training is giving thousands of working adults the confidence and skills to finally speak fluently at work - unlocking business outcomes along the way.", "speakers": [{"name": "Christian Rowe", "position": "Co-Founder, Chief Growth Officer at Immerse"}]}, {"category": "Networking", "title": "Inventures Evening Reception", "description": "Join us for an unforgettable evening reception on Day 2 of Inventures, featuring a harmonious blend of live music, innovative fashion, and gourmet street-style eats. As you step into the venue, be greeted by our majestic stilt walker, setting the stage for a night full of entertainment and indulgence. Prepare for a night of fun and flair, perfect for anyone looking to combine the excitement of a concert with the elegance of a fashion show and the taste of gourmet street food.  Entertainment and Activities include:  LED Fashion Show: Witness cutting-edge style at the LED fashion show, where dazzling lights meet high fashion in a spectacular runway display.  David Usher Acoustic Concert: Enjoy the soulful melodies of David Usher, performing live in an intimate acoustic setting.  360 Photo Booth: Immortalize your evening with dynamic snapshots from our 360 photo booth sponsored by Event Combo.  Sombilon: Experience the artistic ambiance that Sombilon brings to our pre-function space.  EZRobotics and Ameca: Explore the forefront of robotic innovation with displays from EZRobotics and the impressive Ameca robot.", "speakers": []}, {"category": "Ancillary Pitch Programming", "title": "Inventures Neurotech Pitch Competition", "description": "In partnership with Alberta Innovates, Hotchkiss Braun Institute, Campus Alberta Neuroscience, Branch Out Foundation, Thin Air Labs, Startup TNT, and NeurAlbertaTech, The Ontario Brain Institute presents the Inventures Neurotech Pitch Competition Featuring Alberta’s latest and greatest neurotechs for a chance at a $25,000 cash prize.", "speakers": [{"name": "Dr. Lawrence Korngut", "position": "Director of Innovation & Commercialization at Hotchkiss Brain Institute"}, {"name": "Ricky Mehra", "position": "General Partner at Continuum Health Ventures"}, {"name": "Aleia Robin", "position": "Managing Director at Branch Out Neurological Foundation"}, {"name": "Crystal Phillips", "position": "Vice President, Fund I at Thin Air Labs"}]}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "Health Innovation Rooftop Rendezvous *Pre-Registration Required", "description": "Creative Collisions: This event brings together people from various sectors, facilitating networking and activating collaborations, partnerships, and knowledge exchange.    Exclusive Announcements: Preview Alberta Innovates’ new programs and emerging ecosystem technologies.    Awards Celebration: Enjoy the Alberta Innovates inaugural Digital Health Innovation Awards in recognition of the remarkable individuals and companies strengthening the digital health innovation landscape in Alberta.    PLUS: Prizes, Games and music curated by DJ BLKFT!    Register here (Max 300 attendees):  NOTE: You must show proof of registration to gain entry.", "speakers": []}, {"category": "Registration", "title": "Registration", "description": "Badge collection is available in the Exhibition Hall Foyer area of the convention centre. This is for delegates who have registered online and purchased a ticket for Inventures in advance using our online registration system.   STUDENTS AND MEDIA: Badge collection for students and media is available at the kiosk window/counter just inside the ground-level entrance to the convention centre North Building, just beyond the convention centre information desk. Student ID or Media Accreditation must be shown to collect your badge.  ONSITE TICKET PURCHASE: If you need to purchase a ticket onsite, we encourage you to use the online registration link available on the Inventures 2024 website using your smartphone or laptop. You can then pick up your badge at registration. Should you require assistance with the onsite purchase of tickets, please visit the kiosk window/counter just inside the ground-level entrance to the convention centre North Building, just beyond the convention centre information desk. Onsite ticket purchase is not available at any other location.", "speakers": []}, {"category": "Networking", "title": "Connection Hub at The Colab: powered by University of Alberta", "description": "Looking for a quiet place to have a 1:1 chat? This is your space. Welcome to Connection Hub at The Colab, your spot for one-on-one discussions at Inventures. Designed for intimate networking and collaboration, this space accommodates up to 11 pairs at a time, ensuring meaningful interactions and focused conversations. Engage directly with members of the University of Alberta team, share insights, explore potential collaborations, and discuss future opportunities. Activated by University of Alberta as part of their sponsorship, this hub serves as a focal point for innovation and partnership.", "speakers": []}, {"category": "Breakfast & Networking", "title": "Breakfast Bites & Networking", "description": "Join us for coffee, light breakfast bites, and networking before the start of Inventures programming, available in the Exhibition Hall Foyer, MacLeod Foyer, Telus Foyer, and Glen Foyer. This is a great opportunity to visit the exhibitors and experiential elements of Inventures.", "speakers": []}, {"category": "Featured", "title": "Future Innovators *Pre-Registration Required", "description": "Investing in the next generation of innovation is crucial for shaping a brighter, more resilient future. Inventure$ Future Innovators offers a one-of-a-kind experience designed exclusively for young innovators. This dynamic programming brings together the brightest minds, disruptors, and change-makers of the next generation, including: •Best of the Best: Immerse yourself in the cutting-edge world of Inventure$, experience world-class technology throughout the conference. •Hands-On Learning with Dr. Ron Markowski: Dive into an interactive workshop led by the renowned Dr. Ron Markowski. Get your hands dirty, experiment, and explore transformational technologies that will shape our future. •Youth Networking Extravaganza: Connect with like-minded peers, forge new collaborations, and ignite sparks of innovation. Whether you’re a budding entrepreneur, a tech enthusiast, or a creative thinker, this is your chance to build lasting connections. •Keynote Talk by Phil De Luna: Brace yourself for an inspiring keynote address by brilliant young leader and innovator, Phil De Luna. Discover how he’s pushing boundaries, challenging norms, and redefining what’s possible in the world of innovation. •Premier’s Address, Pitch Award Ceremony, Keynote Presentation by Poppy Crum, and Closing Ceremonies: These pivotal moments will shape your journey at Inventures Unleashed. From the Premier’s insights to the electrifying pitches, Poppy Crum’s thought-provoking talk, and the grand finale of closing ceremonies, you’ll be part of an innovation revolution.", "speakers": []}, {"category": "Earth Tech: Building Everything Better", "title": "Print the Future: Navigating Additive Manufacturing in Canada", "description": "Additive manufacturing, a trailblazing production method, is sweeping across the globe. But what about Canada? In this dynamic session, we unravel the potential of 3D printing, spotlighting its impact on research and industry. Join us as we demystify additive manufacturing and empower Canadian businesses to embrace innovation.", "speakers": [{"name": "Dave Waldbilig", "position": "Principal Engineer - Advanced Manufacturing and Materials at InnoTech Alberta"}, {"name": "Carrie Nystrom", "position": "Co-Founder, CEO at Solar Optim"}, {"name": "Carter Will", "position": "Director, Advanced Manufacturing at Exergy Solutions"}, {"name": "Mihaela Vlasea", "position": "Associate Professor at University of Waterloo"}]}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "Inventures Startup Pitch Competition", "description": "Watch as our five finalists pitch their product or service to our audience of venture capitalists, angel investors, entrepreneurs, early adopters, business educators and service providers. The winning company from each program track will be announced during the Inventures Closing Ceremony on May 31 and receive $10,000!", "speakers": [{"name": "Maninder Dhaliwal", "position": "Managing Partner at Startup Studio – Accelerator and Venture Fund"}, {"name": "Olivia Hornby", "position": "Managing Partner at Spring Impact Capital Management Inc"}, {"name": "Natasha Spokes", "position": "Director, Ventures at Creative Destruction Lab Rockies"}, {"name": "Dozie Amuzie", "position": "Head at Johnson & Johnson Innovation – JLABS Canada"}]}, {"category": "Blurring Boundaries", "title": "Innovate for Impact: Driving Prosperity Through Tech & Policy", "description": "Discover actionable insights on harnessing governmental data, AI and innovation to foster societal prosperity and improve public outcomes. You'll hear about real life examples of success, challenges being faced, what entrepreneurs and investors can do to help and continue the discussion on how the private sector and Government can work together to help impact this trillion-dollar challenge that's being faced across North America and beyond.Don’t miss this opportunity to see how technology and strategic policy can create meaningful change and be a part of the solution.", "speakers": [{"name": "Ashif Mawji", "position": "Managing Director at ScaleGood Fund LP"}, {"name": "Marshall Smith", "position": "Chief of Staff at Premier of Alberta Office"}, {"name": "Chief. Dale Mcfee", "position": "Chief at Edmonton Police Service"}]}, {"category": "Blurring Boundaries", "title": "Virtual & Augmented Reality: Immersive & Interactive Experiences for Training, Collaboration & Innovation", "description": "Through collaborative discussions and insights from experts in both at-home patient therapy and caregiver support, attendees will gain a comprehensive understanding off innovative solutions that enhance stroke recovery outcomes for patients while also supporting the wellbeing of their caregivers.", "speakers": [{"name": "Lloyd Summers", "position": "Technical Co-founder & Chief Technology Officer at Red Iron Labs"}, {"name": "Mike Lohaus", "position": "Design Lead at Neuro RecoVR"}, {"name": "Joanna Wynn", "position": "Tech Community Builder"}]}, {"category": "Shared Studios: INVENTURE$ Canada Portal", "title": "Engaging Indigenous AI", "description": "Step into our portal and meet innovators from around the globe. Engage in real-time conversations with innovators from Kabakoo Academies, based in Bamako Mali, to learn how they are merging high-tech and Indigenous knowledge to decolonize minds and solve real-life challenges.", "speakers": []}, {"category": "Earth Tech: Building Everything Better", "title": "A Flight Plan for Sustainable Aviation Fuel", "description": "As the aviation industry aims to achieve net-zero carbon emissions by 2050, Sustainable Aviation Fuel (SAF) can play a vital role. Canada has the potential to take the lead in establishing a sustainable aviation fuel value chain. However, there are significant challenges to overcome on the path to achieving this goal. Join industry leaders as they discuss a path forward for building a sustainable aviation value chain in Canada and globally.", "speakers": [{"name": "Amanda Mesluk", "position": "Senior Sustainability Manager at Flair Airlines"}, {"name": "Tyler Tarnoczi", "position": "Co-Founder at ScopeX Markets"}, {"name": "Andrea Decore", "position": "EVP Strategy & Corporate Development at Tidewater Renewables"}, {"name": "Chris Dinsdale", "position": "President & CEO at Calgary Airport"}]}, {"category": "Entrepreneurship", "title": "Digital Pathways: Indigenous Researchers Behind Innovative Tech", "description": "As technological developments grow more complex, new innovations increasingly require thorough research and design processes. Find out why Indigenous peoples are becoming leaders in the research and design of new product innovations in the tech space.", "speakers": [{"name": "Melissa Gladue", "position": "Business Development Manager at Futurpreneur Canada"}, {"name": "Sam Swanson", "position": "Marketing Specialist at Futurpreneur"}, {"name": "Kyle Napier", "position": "Instructor / Consultant / Researcher / Designer"}, {"name": "Tracy Persson", "position": "Founder at My Breast day Inc."}]}, {"category": "Blurring Boundaries", "title": "Are You Ready for a Board... Maybe!", "description": "Join us for an enlightening discussion with seasoned industry leaders as they demystify the role of boards of directors in today’s business landscape. Our panelists will delve into the benefits, best practices, and common misconceptions surrounding boards. From strategic guidance to risk management, they’ll share insights that can transform your company’s trajectory.", "speakers": [{"name": "Judy Fairburn", "position": "Fund Managing Partner at The51 Ventures Inc."}, {"name": "Dr. Jim Dewald", "position": "Professor of Strategy & Entrepreneurship at Haskayne School of Business"}, {"name": "Blaine LaBonte", "position": "President at DJI Capital"}, {"name": "Alice Reimer", "position": "CEO at Fillip Fleet"}, {"name": "Mary Cameron", "position": "Principal at Ozone Advisory Group Inc."}]}, {"category": "Tech Triathlon: Quantum + AI + IoT", "title": "Game On: Unleashing the Economic Power of E-Sports", "description": "E-sports and gaming are rapidly emerging as lucrative sectors with significant economic impact. From creating diverse job opportunities in game development to establishing a robust spectator sport circuit, the industry offers a wealth of investment potential. Join this session to learn the economic influence of e-sports and its how to tap into this dynamic market.", "speakers": [{"name": "CK Dhaliwal", "position": "Chief Partnerships Officer at ESport Canada"}, {"name": "Tori Romano", "position": "Business Development Manager, Digital Media & Entertainment at Calgary Economic Development"}, {"name": "Ryan Coutts", "position": "ESport Canada"}]}, {"category": "Blurring Boundaries", "title": "Improving Employee Retention for a Neurodiverse Workforce", "description": "Join us for a session focused on blending technology and social innovation to empower neurodiverse people, while also deconstructing ableism and fostering allyship in business. Gain actionable insights into creating inclusive environments and driving competitive advantage through diversity. Walk away ready to champion inclusivity in both professional and social spheres.", "speakers": [{"name": "Filip Velimirovic", "position": "Corporate Partnerships Manager at QueerTech"}, {"name": "Ty McKinney", "position": "CEO & Co-Founder at 8 Bit Cortex"}, {"name": "Tara Langan", "position": "Talent Management Lead / Neuroinclusion Strategist at ISL Engineering"}, {"name": "Carol Sun", "position": "Community & Engagement Lead at Gateway Association for Community Living"}]}, {"category": "Entrepreneurship", "title": "Canada's Technology Access Centres (TACs): Helping Businesses Innovate Faster through R&D", "description": "Discover how TACs are helping companies to accelerate the development and commercialization of new innovations. In this session, TAC representatives will explain how their centers are advancing various industry sectors through college-applied research projects. Join this session to learn how your company can work with a TAC to achieve your innovation objectives while retaining all the IP and equity in your business and accessing government grants to make R&D projects more affordable.", "speakers": [{"name": "Ken Doyle", "position": "Executive Director at Tech-Access Canada"}, {"name": "Michael William Long", "position": "Dean - Applied Research and Innovation at College of the North Atlantic - Office of Applied Research and Innovation"}, {"name": "Carly Kelly", "position": "Center Manager at Loyalist College"}, {"name": "David Berthiaume", "position": "Executive Director at Kemitek"}]}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "Data is the Key to Personalized Health", "description": "Recent developments in data/digital technology and its impact on advancing precision health. The goal is to provide insights into the developments of precision health and how it impacts patient health and wellbeing.", "speakers": [{"name": "Dr. Edith Pituskin", "position": "Associate Professor, Faculty of Nursing at University of Alberta"}, {"name": "Dr. Anmol Kapoor", "position": "CEO and Founder at BioAro Inc."}, {"name": "Dr. Sabina Bruehlmann", "position": "CEO at Nimble Science"}, {"name": "Jakob Due", "position": "Head of Department at The Danish Health Data Authority"}, {"name": "Dr. Richard Fahlman", "position": "Professor at University of Alberta"}]}, {"category": "Entrepreneurship", "title": "The Best of the ASTech Awards: 35 Years of Outstanding Alberta Science & Technology Leaders", "description": "The ASTech (Alberta Science and Technology) Leadership Awards has recognized significant societal and economic achievements, for over three decades. Join us in this session to gain insights into the journeys and transformative contributions of ASTech Alumni, and discover how their momentum - and the collaboration of government, industry, academia, entrepreneurs, and innovation champions - has helped propel Alberta forward through job creation, advancements in academia, and nurturing the growth of innovative start-ups.", "speakers": [{"name": "Jeff LaFrenz", "position": "Co-Founder and President at VizworX Inc."}, {"name": "Gail Powley", "position": "President at Technology Alberta"}, {"name": "Mehadi Sayed", "position": "President at Clinisys"}, {"name": "Tim Carwell", "position": "CEO at CommAlert Group"}]}, {"category": "Growing Up: Food Tech Farm to Fork", "title": "Nature Inspired: Biological Solutions for Agricultural Challenges", "description": "Given the negative impacts of biotic and abiotic stress on agriculture, as well as the environmental challenges of both large-scale monoculture and climate impacts, there is a growing interest in biological solutions and alternative growing methods.  Opportunities exist to leverage nature-based solutions, Indigenous Traditional Knowledge, and regenerative agricultural practices that work in harmony with ecological systems to grow agricultural production while protecting nature and sequestering emissions. Join this session to hear from innovative practitioners who are advancing investible, nature-inspired solutions that can support the economy and the planet.", "speakers": [{"name": "Peter Gross", "position": "Chief Technology Officer at Lucent Biosciences"}, {"name": "Dana Gibson", "position": "Executive Director at Smart Agriculture and Food, Alberta Innovates"}, {"name": "Tom Lynch- Staunton", "position": "Regional Vice-President - Alberta at Nature Conservatory of Canada"}, {"name": "Janna Greir", "position": "Co-Founder at Solar Sheep Inc."}]}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "Alberta Cancer Foundation's Breakthrough Fund Announcement", "description": "Launched in 2023, the Breakthrough Fund is Alberta Cancer Foundation’s venture philanthropy program. Join us as we announce and celebrate the inaugural oncology companies that ACF has invested in.", "speakers": []}, {"category": "Networking", "title": "Networking Break", "description": "Refreshments will be available in all pre-function areas of the conference centre throughout the event, including during networking breaks.   Grab a drink and a snack in the Exhibition Hall Foyer, Macleod Foyer, Telus Foyer, or Glen Foyer. This is a great opportunity to visit the exhibitors and experiential elements of Inventures.", "speakers": []}, {"category": "Pop-Up Q&A", "title": "Pop-Up Q&A", "description": "Are you ready to connect with the brightest minds, industry leaders, venture capitalists and entrepreneurs who are solving the most critical issues of our time? Look no further! Our exclusive pop-up Q&A brings together thought leaders from across the globe for a quick and insightful talks followed by a rapid fire, interactive audience Q&A. Don't miss out on the opportunity to gain direct access to the movers and shakers advancing innovation!", "speakers": [{"name": "Phil  De Luna", "position": "Chief Carbon Scientist and Head of Engineering at Deep Sky"}]}, {"category": "Featured", "title": "Innovating the next 50 Years of Prosperity-A Conversation with Premier Danielle Smith", "description": "Alberta is known for its strengths in innovation and business – from oil sands to tech unicorns, the province is Canada's economic engine.  How is this natural resource rich economy setting course for the next 50 years? What are the province’s leaders considering when creating policy that will shape the socio-economic direction of the next generation of innovators and industries?  In this session, hear from Alberta Premier Danielle Smith and Moderator (TBC) as they discuss Alberta’s path forward through the next 50 years.", "speakers": [{"name": "The Honourable. Danielle Smith", "position": "Premier of Alberta"}, {"name": "Martha Hall Findlay", "position": "Director at School of Public Policy, University of Calgary"}]}, {"category": "Networking", "title": "Networking Break", "description": "Refreshments will be available in all pre-function areas of the conference centre throughout the event, including during networking breaks.   Grab a drink and a snack in the Exhibition Hall Foyer, Macleod Foyer, Telus Foyer, or Glen Foyer. This is a great opportunity to visit the exhibitors and experiential elements of Inventures.", "speakers": []}, {"category": "Networking", "title": "Connection Hub at The Colab: powered by University of Alberta", "description": "Looking for a quiet place to have a 1:1 chat? This is your space. Welcome to Connection Hub at The Colab, your spot for one-on-one discussions at Inventures. Designed for intimate networking and collaboration, this space accommodates up to 11 pairs at a time, ensuring meaningful interactions and focused conversations. Engage directly with members of the University of Alberta team, share insights, explore potential collaborations, and discuss future opportunities. Activated by University of Alberta as part of their sponsorship, this hub serves as a focal point for innovation and partnership.", "speakers": []}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "Unveiling Pharmacology's Future: AI, Commercialization & Innovation", "description": "Explore the evolving landscape of pharmacology, where AI and Machine Learning drive drug development and research, tackle commercialization hurdles, and fuel groundbreaking health innovations.", "speakers": [{"name": "Jim West", "position": "Associate Director at BioTools Innovator"}, {"name": "Bibaswan Ghoshal", "position": "Senior Director, Technology Adoption at OBIO: Ontario Bioscience Innovation Organization"}]}, {"category": "Earth Tech: Building Everything Better", "title": "Innovative Construction: Harnessing Technology for Collaborative Efficiency On-Site", "description": "Discover hands-on examples of how digital design and construction technologies enhance communication, streamline processes, and reduce waste, showcasing a sustainable approach to modern construction.", "speakers": [{"name": "Dylan Kunz", "position": "Academic Chair- Civil Engineering Technology, School of Construction at SAIT"}, {"name": "Rick Duchscher", "position": "SAIT Connector Lead at Southern Alberta Institute of Technology"}, {"name": "Kashish Madaan", "position": "Lead - Digital Construction (Southern Alberta and Interior BC) at Bird Construction"}, {"name": "Ashli MacDonald", "position": "Job Captain at GEC Architecture"}]}, {"category": "Entrepreneurship", "title": "Driving Innovation from Within: Fostering Innovation in your Organization", "description": "In today's rapidly evolving business landscape, innovation stands as the cornerstone of corporate expansion and competitive edge.  Innovation requires more than just visionary ideas;  it demands a strategic approach that often stems from within, nurtured by the creative minds within your own team. Join us to explore strategies for corporations to unlock the full potential of your teams, properly fund these efforts and drive innovation from within.", "speakers": [{"name": "Glen McCrimmon", "position": "Director of Operations at CRIN"}, {"name": "Michael Mannix", "position": "Founding Partner at Band Venture Partners'"}, {"name": "Phil  De Luna", "position": "Chief Carbon Scientist and Head of Engineering at Deep Sky"}]}, {"category": "Growing Up: Food Tech Farm to Fork", "title": "Plant a Seed, Harvest a Dream", "description": "Join us for an engaging exploration of community-driven initiatives transforming agri-food systems. Our panel of experts will spotlight successful projects that harness local wisdom, youth empowerment, foster collaboration, and drive sustainable change. From soil to table, discover how innovation blooms when communities take the lead.", "speakers": [{"name": "Alfred Burgesson", "position": "Founder and CEO at Tribe Network"}, {"name": "Zaffia Laplante", "position": "COO at SkyAcre Technologies Inc."}, {"name": "Kolade Kolawole-Boboye", "position": "Creative Director of Youth Impact Business at Hope Blooms"}]}, {"category": "Shared Studios: INVENTURE$ Canada Portal", "title": "Sustainable Approaches to \"Fast\" Fashion", "description": "Step into our portal and meet innovators from around the globe. Engage in real-time conversations with sustainable fashion designers from Johannesburg, South Africa, to learn how they are building recognizable brands while clearing up the world’s fashion waste. Understand how these designers are positioning the African continent as the next home of global fashion.", "speakers": []}, {"category": "Entrepreneurship", "title": "Empowering Immigrant Founders: Overcoming Cultural Barriers in the Investment Landscape", "description": "The entrepreneurial journey for immigrant founders is a unique blend of resilience, innovation, and cultural adaptation. Join our panel of seasoned investors, industry experts, and immigrant entrepreneurs as we delve into the challenges faced by this dynamic group. From navigating cultural nuances to securing funding, we’ll explore actionable insights to empower immigrant founders in the investment landscape.", "speakers": [{"name": "Neeraj Gupta", "position": "Angel Investor"}, {"name": "C.M. Samala", "position": "Head of Community and Culture at Unshackled Ventures"}, {"name": "Nikhil Bedi", "position": "EiR at UCeed Funds"}, {"name": "Raissa Espiritu", "position": "Co-Managing Partner, Audaxa Ventures & Executive in Residence, UCeed Cenovus EDI Accelerator at Audaxa Ventures & UCeed"}]}, {"category": "Entrepreneurship", "title": "Bold Moves, Smart Risks: Managing Uncertainty in Disruptive Industries", "description": "From market volatility to regulatory challenges, disruptive ventures often face unique risks. Join this session to hear more about the challenges these ventures face and learn essential strategies for mitigating them. Through engaging case studies and practical insights, uncover how successful ventures thrive amidst uncertainty. You'll also be invited to share your experiences in this interactive discussion, gaining valuable knowledge and leaving you equipped to navigate this disruptive landscape with confidence.", "speakers": [{"name": "Nathan Mison", "position": "Founding Partner at DIPLOMAT Consulting"}, {"name": "Christine Maligec", "position": "Chief Risk Officer at First Canadian"}, {"name": "Jesse Meyer", "position": "Partner at Incite"}, {"name": "Steve Berna", "position": "COO at FNFA"}]}, {"category": "Live Long, Live Well: Unveiling Health Data", "title": "The Power and Potential of Private Public Partnerships in Healthcare", "description": "Few economic activities simultaneously drive innovation and growth while directly improving public well-being and health. Connecting health care with advances in the life sciences is one such exceptional area.   The panel will leverage senior thought leaders who are committed to building effective and robust public private partnerships - a former Minister of Health; a large multinational corporation; a national procurement solutions provider CEO and a venture capitalist.  The Panel will exchange views and discuss the mindsets, levers, and policies required for a reciprocal partnerships in our health care system.", "speakers": [{"name": "Jason Copping", "position": ""}, {"name": "Bruce Birdsell", "position": "Vice President, Oncology Market Development at Alpharetta"}, {"name": "Ricky Mehra", "position": "General Partner at Continuum Health Ventures"}, {"name": "Tim Murphy", "position": "VP, Health at Alberta Innovates"}, {"name": "Christine Donaldson", "position": "CEO & President at HealthPRO Canada"}]}, {"category": "Blurring Boundaries", "title": "Ignite: Youth Innovators Unleashed", "description": "Join us for an electrifying journey into the world of tech innovation! “Ignite: Youth Innovators Unleashed” brings together trailblazing young minds who are reshaping the tech landscape. In this dynamic panel, you’ll hear firsthand from rising stars—engineers, designers, and entrepreneurs—whose spark talks will ignite your passion for innovation", "speakers": [{"name": "Sophia Fairweather", "position": "Founder at Key-Angels"}, {"name": "Salma Elzayat", "position": "TKS Innovator | BCI Enthusiast at The Knowledge Society"}, {"name": "Inayat Kang", "position": "Neurotech Enthusiast at TKS"}]}, {"category": "Tech Triathlon: Quantum + AI + IoT", "title": "Visualizing Animal Welfare: Advancing Care Through AI & Innovation", "description": "Experts will discuss leveraging visual AI for pain recognition in animals, innovative treatment for dairy cattle, and the use of computer vision technology in animal care management. Learn how these advancements are shaping the future of animal welfare and achieving more effective and compassionate care practices.", "speakers": [{"name": "Ali Pormohammad", "position": "President at MHCombiotic Inc"}, {"name": "Susan Groeneveld", "position": "CEO/Founder at Sylvester.ai"}, {"name": "Geoffrey Shmigelsky", "position": "CTO at OneCup AI"}]}, {"category": "Growing Up: Food Tech Farm to Fork", "title": "Building the Bioeconomy with Food, Farming and Forestry", "description": "Biofuels are a promising option for achieving a carbon-neutral future as they make use of existing infrastructure and require little to no retrofits. However, there are still some challenges that need to be addressed, including regulatory approval, technological limitations, feedstock supply, and demand for uptake, which have hindered the wider adoption of this solution. This panel will discuss how they have tackled each of these challenges and brainstorm with the audience on ideas and other ways to address these concerns.", "speakers": [{"name": "Emmanuella Sea-Nduka", "position": "Business Partner at Greenhouse Gas Mitigation, Alberta Innovates"}, {"name": "Doug Greening", "position": "Project Development Manager at Steeper Energy"}, {"name": "Geoffrey Tauvette", "position": "Executive Director/Directeur Général at Canadian Council for Sustainable Aviation Fuels | Conseil canadien des carburants d'aviation durable"}, {"name": "Kavanagh Mannas", "position": "VP Corporate Development at Canary Biofuels"}]}, {"category": "Keynote", "title": "Meet and Greet: Dr. Poppy Crum", "description": "Dr. Poppy Crum, Inventures 2024 closing keynote speaker, is available for a meet and greet! Don’t miss your opportunity to shake hands and grab a photo with this visionary futurist, neuroscientist, and leading technologist.", "speakers": [{"name": "Dr. Poppy Crum", "position": "Futurist, Neuroscientist, and Technologist at Stanford University"}]}, {"category": "Lunch & Networking", "title": "Plated Friday Lunch", "description": "A plated lunch will be served on Friday, May 31. Lunch will lead into the final programming elements of Inventures 2024, including the Pitch Awards, Closing Keynote, and Closing Ceremonies.   The plated lunch is available to delegates who registered for Inventures online and purchased a ticket by the cut-off date of Thursday, May 16. Your badge and lanyard will indicate whether you are eligible to receive lunch.   The plated lunch is not available for onsite purchase. Limited seating may be available for delegates who did not register in time to receive lunch but wish to attend the final programming.", "speakers": []}, {"category": "Featured", "title": "Pitch Awards Ceremony", "description": "Join us for the Inventures Pitch Awards, where the winners of the Inventures pitch competitions will be announced! An Inventures Startup Pitch Competition winner will be chosen from each of the six program tracks and will each receive $10,000, while the winners of our partner events will also be revealed!* The Plug and Play AI in Energy Innovation Challenge * UCalgary x TC Energy Ingenuity Pitch Prize * SVG Ventures I Thrive Climate Challenge Pitch Showcase * Inventures Neurotech Pitch Competition", "speakers": [{"name": "Laura Kilcrease", "position": "Chief Executive Officer at Alberta Innovates"}]}, {"category": "Keynote", "title": "Empathetic Technologies: Leading Humanity into the Future", "description": "In a world where our attention is capacity limited, and is possibly our most valuable commodity, empathetic technologies can help us connect with each other and ourselves in the most human ways. In this inspiring closing keynote, visionary futurist, neuroscientist, and technologist Dr. Poppy Crum will discuss how we can create a world where we care about each other more effectively, where we know more about when someone is feeling something that we ought to pay attention to, and where we have richer, more human experiences from our technology.", "speakers": [{"name": "Dr. Poppy Crum", "position": "Futurist, Neuroscientist, and Technologist at Stanford University"}, {"name": "Darrell Brertton", "position": "Saddle Lake Cree Nation"}]}, {"category": "Featured", "title": "Closing Ceremony", "description": "Inventures 2024 concludes with an energetic performance you won’t want to miss. A fitting close to your Inventures experience, it’s sure to leave you inspired and excited about what’s possible when humanity meets technology. You’ll also get a hint of what’s in store for Inventures 2025!", "speakers": [{"name": "Laura Kilcrease", "position": "Chief Executive Officer at Alberta Innovates"}]}]